{"RECDATA":[{"FacilityID":"244689","LegacyFacilityID":"","OrgFacilityID":"74393","ParentOrgID":"131","ParentRecAreaID":"1117","FacilityName":"Forest Road 60","FacilityDescription":"\u003cp\u003eForest Road 60 begins at Forest Road 24, near Peterson Prairie Cabin and ends at The Wind River Hwy / Forest Road 30. Popular attractions along this road are Goose Lake and Goose Lake Campground, Trailhead access to the Pacific Crest National Scenic Trail, and Crest Horse Camp.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"","COORDINATES":null},"FacilityLongitude":0,"FacilityLatitude":0,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"238873","LegacyFacilityID":"","OrgFacilityID":"78489","ParentOrgID":"131","ParentRecAreaID":"1120","FacilityName":"Mount Skokomish Wilderness","FacilityDescription":"\u003cp\u003eThe 13,015 acre Mt. Skokomish Wilderness is located in the southeast portion of the Olympic National Forest, north of Lake Cushman in Mason County. This Wilderness includes very steep terrain ranging in elevation from 800 feet near Lake Cushman to the 6,612 foot summit of Mt. Stone. Other major peaks include Mt. Skokomish 6,434', Henderson 6,000', Pershing 6,154', and Washington 6,255'. Barren ridges and numerous steep-faced rock outcrops are present throughout this Wilderness.\u003c/p\u003e\u003cp\u003eStands of old-growth occur on the lower slopes consisting primarily of Douglas-fir, western hemlock and western red cedar. At the upper elevations, subalpine fir and western white pine give way to rock and scattered alpine vegetation commonly found in the subalpine and alpine zones.\u003c/p\u003e\u003cp\u003eThe Hamma Hamma River is the only major stream flowing through the Wilderness. Mildred Lakes are a popular destination in the Wilderness.\u003c/p\u003e\u003cp\u003ePlease follow regulations and use \u003ca href=\"http://lnt.org/learn/7-principles\"\u003eLeave No Trace\u003c/a\u003e techniques to help keep this area wild, clean, and pristine.\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eElevation Range:\u003c/strong\u003e 800' to 6,612'\u003c/li\u003e\u003cli\u003eMt. Skokomish Wilderness\u003ca href=\"http://www.fs.usda.gov/Internet/FSE_DOCUMENTS/fsbdev3_049464.pdf\" target=\"_blank\"\u003e recreation opportunity guide\u003c/a\u003e (PDF)\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eKey Access Points: \u003c/strong\u003e\u003ca href=\"http://www.fs.usda.gov/recarea/olympic/recreation/recarea/?recid=78489#access-skokomish\"\u003eTrail and trailhead access information\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstyle type=\"text/css\"\u003e.embed-container {position: relative; padding-bottom: 80%; height: 0; max-width: 100%;} .embed-container iframe, .embed-container object, .embed-container iframe{position: absolute; top: 0; left: 0; width: 100%; height: 100%;} small{position: absolute; z-index: 40; bottom: 0; margin-bottom: -15px;}\u003c/style\u003e\u003c/p\u003e\u003cdiv class=\"embed-container\"\u003e\u003csmall\u003e\u003ca href=\"//usfs.maps.arcgis.com/apps/Embed/index.html?webmap=51f650f63d534c7a9d8f76c8faf3fd40\u0026extent=-123.3794,47.4907,-123.1391,47.6077\u0026home=true\u0026zoom=true\u0026scale=true\u0026legend=true\u0026basemap_gallery=true\u0026disable_scroll=true\u0026theme=light\" style=\"color:#0000FF;text-align:left\" target=\"_blank\"\u003eView larger map\u003c/a\u003e\u003c/small\u003e\u003cbr/\u003e\u003ciframe frameborder=\"0\" height=\"400\" marginheight=\"0\" marginwidth=\"0\" scrolling=\"no\" src=\"//usfs.maps.arcgis.com/apps/Embed/index.html?webmap=51f650f63d534c7a9d8f76c8faf3fd40\u0026extent=-123.3794,47.4907,-123.1391,47.6077\u0026home=true\u0026zoom=true\u0026previewImage=false\u0026scale=true\u0026legend=true\u0026basemap_gallery=true\u0026disable_scroll=true\u0026theme=light\" title=\"Region 6 Wilderness Map\" width=\"500\"/\u003e\u003c/div\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eMount Skokomish Wilderness is within the\u003ca href=\"http://fs.usda.gov/recarea/olympic/recreation/recarea/?recid=79318\"\u003e South Hood Canal \u003c/a\u003earea.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003e\u003ca name=\"access-skokomish\"/\u003eTrails that access Mount Skokomish Wilderness\u003c/strong\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"http://www.fs.usda.gov/recarea/olympic/recreation/recarea/?recid=47877\"\u003eMildred Lakes Trail #822\u003c/a\u003e - This 4.5 mile primitive trail has extremely steep pitches and is the major access into the Wilderness. The elevation gain on this trail is 2,100 feet and is considered most difficult.\u003c/li\u003e\u003cli\u003e\u003ca href=\"http://www.fs.usda.gov/recarea/olympic/recreation/recarea/?recid=47885\"\u003eMt. Rose Trail #814\u003c/a\u003e - This 4.8 mile trail provides steep access to the summit of Mt. Rose at the southern end of the Wilderness and is considered most difficult.\u003c/li\u003e\u003cli\u003e\u003ca href=\"http://www.fs.usda.gov/recarea/olympic/recreation/recarea/?recid=47907\"\u003ePutvin Trail #813\u003c/a\u003e - It is 3.0 miles to the Olympic National Park boundary. Accesses the north portion of the Wilderness and is very steep and is considered most difficult.\u003c/li\u003e\u003cli\u003e\u003ca href=\"http://www.fs.usda.gov/recarea/olympic/recreation/recarea/?recid=47881\"\u003eMt. Ellinor #812\u003c/a\u003e - This trail is 3.1 miles in length.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eTopo Maps\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eMt. Steel USGS Quad or Mt. Skokomish-Lake Cushman Custom Correct Map.\u003c/p\u003e\u003cp\u003eDownload free \u003ca href=\"http://data.fs.usda.gov/geodata/rastergateway/states-regions/regions_zoom.php?regionID=r6\"\u003eU.S. Forest Service Topo Maps\u003c/a\u003e here.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eRecreational Opportunities\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eThe Mt. Skokomish Wilderness has excellent opportunities for backpacking, mountain climbing, fishing, and camping. There are over 13 miles of trail inside the Mt. Skokomish Wilderness. Wilderness visitors should always carry rain gear and adequate clothing, food, and backpacking equipment. Proper boots and clothing should be worn. \u003ca href=\"http://www.fs.usda.gov/Internet/FSE_DOCUMENTS/fsbdev3_049429.pdf \"\u003eLeave No Trace\u003c/a\u003e.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[0,0]},"FacilityLongitude":0,"FacilityLatitude":0,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"234632","LegacyFacilityID":"75544","OrgFacilityID":"AN375544","ParentOrgID":"131","ParentRecAreaID":"1116","FacilityName":"SWAN LAKE KITCHEN","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\nA variety of activities await visitors at the open air Swan Lake Kitchen. Located within the Swan Lake Campground, the group site is situated on a large, flat open space near the beach. The kitchen itself is located up the hill from the beach in the trees.  The kitchen is accessible via a staircase from the parking area and a path from the beach. A day of swimming, boating, fishing or hiking can be topped off with a trip to the kitchen to wind down and enjoy a group meal.\n  \nOriginally built in 1936 by the Civilian Conservation Corps, the site was historically preserved in 2009 and retains its charming historic character. \u003ch2\u003eRecreation\u003c/h2\u003e\nSwan Lake has a sandy beach with a swimming dock, plus access to the Swan Lake Trail #14. The trail boasts views of the lake and seasonal huckleberries. Wildlife watching is excellent and the lake is home to loons throughout most of the summer. \n\u003ch2\u003eFacilities\u003c/h2\u003e\nThe covered kitchen comes with several picnic tables, a campfire ring, a stone fireplace, drinking water, vault toilets and garbage containers. The site is suited to groups of 35. \u003ch2\u003eNatural Features\u003c/h2\u003e\nAt an elevation of 3,640 feet, Swan Lake Kitchen is located in a wooded area overlooking the 52-acre Swan Lake. The kitchen is on the north end of the lake near the swimming beach. \n\u003cbr/\u003e\u003cbr/\u003e\nThe 1.1 million acre Colville National Forest lies in the northeast corner of Washington. The forest's great salmon runs first attracted native Americans to the area, then miners, homesteaders and fur trappers followed. The variety of resources and natural beauty in the region continues to attract visitors.\n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nThe Republic Ranger Station and the Stonerose Interpretive Center are 15 miles north in the town of Repbulic.","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"From Seattle take Highway 2 east to Wenatchee, Highway 97 north to Tonasket, then Highway 20 east to Republic. From Republic take Highway 21 south seven miles to paved Forest Road 53 (Scatter Creek). Travel on FR 53 approximately seven miles to the entrance of Swan Lake Campground.  The kitchen area is located at the far end of the campground.\n","FacilityPhone":" (509)775-7400","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-118.8369444,48.5172222]},"FacilityLongitude":-118.8369444,"FacilityLatitude":48.5172222,"Keywords":"Swan Lake Kitchen,Swan Lake Shelter,Swan Lake Group Site","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"232864","LegacyFacilityID":"71650","OrgFacilityID":"AN371650","ParentOrgID":"131","ParentRecAreaID":"1117","FacilityName":"Beaver Campground","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\nBeaver Campground is nestled among large, old maple and sycamore trees, offering a quiet and private family camping experience. Its location along the Wind River provides opportunities for anglers, but other recreational activities can be found in abundance here as well.\u003cbr/\u003e\u003cbr/\u003e\nOn-site playground equipment and horseshoe games offer fun for all ages and the surrounding forest allows visitors the chance to discover many animal and plant species.\u003ch2\u003eRecreation\u003c/h2\u003e\n\u003cp\u003eThe Wind River offers Chinook salmon and steelhead trout fishing for anglers.(check state regulations for season open/close) And the nearby Washington Department of Fish and Wildlife fish hatchery offers opportunities in the spring to view Chinook salmon.\u003cbr\u003e\u003cbr\u003e\u003cbr\u003eKayaks and canoes are permitted on the Wind River and the surrounding area offers opportunities for hiking, horseback riding and biking.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003eBerry picking is popular in season.\u003c/p\u003e\n\u003ch2\u003eFacilities\u003c/h2\u003e\n\u003cp\u003eThis campground consists of 24 campsites that can accommodate either tents or RVs. One group site is available and can accommodate up to 50 people and 10 vehicles.\u003cbr\u003e\u003cbr\u003e   vault toilets are available and drinking water is offered on-site. Picnic tables and fire pits are provided. \u003cbr\u003e\u003cbr\u003e\u003cbr\u003e Beaver Campground is very unique, having  a swingset, activity field and horseshoe pit available on-site, providing entertainment for all ages.\u003c/p\u003e\n\u003ch2\u003eNatural Features\u003c/h2\u003e\nLocated in southwest Washington State, the Gifford Pinchot National Forest encompasses over 1.3 million acres, including the 110,000-acre Mount St. Helens National Volcanic Monument established by Congress in 1982. \n\u003cbr/\u003e\u003cbr/\u003e\nBeaver Campground is located in the Mount Adams Ranger District, in the easternmost portion of the Gifford Pinchot National Forest. This district spans 367,000 acres and includes the Mt Adams Wilderness, Indian Heaven Wilderness and Trapper Creek Wilderness.\n\u003cbr/\u003e\u003cbr/\u003e\nMt Adams, a potentially active stratovolcano and the second-tallest mountain in Washington state, is a prominent landmark of the District. Elevations here range between 1,200 feet at the Wind River Work Center (12 miles north of Carson, WA) and 12,276 feet at the summit of Mt. Adams.\n\u003cbr/\u003e\u003cbr/\u003e\nA great diversity of habitats and geological features are represented here, from old growth to second growth forests and wetland areas to low and high elevation meadows and lakes, as well as glaciers. \n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nBeaver Campground is one of the closest Forest Service campsites to the Columbia River Gorge and Portland, Oregon. \u003cbr/\u003e\u003cbr/\u003e\nThe nearby town of Carson is known for its hot springs, but visitors can also find the Wind River Arboretum, a golf course, restaurants and shopping.\n\n\u003ch2\u003econtact_info\u003c/h2\u003e\nThis location has limited staffing. Please call (509) 427-3677 for general information.","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"Take Highway 14 to Carson, WA and continue north on Wind River Highway for 13 miles to reach the campground.","FacilityPhone":"541-338-7869","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.9569444,45.8561111]},"FacilityLongitude":-121.9569444,"FacilityLatitude":45.8561111,"Keywords":"BGWR,CARSON,WA WIND RIVER,GIFFORD PINCHOT NF - FS","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"251362","LegacyFacilityID":"125790","OrgFacilityID":"AN425790","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"KANER FLAT CAMPGROUND","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\nKaner Flat Campground, located in the Little Naches Drainage, is a 49 unit campground that has 25 reservable sites between Memorial Day weekend and Labor Day weekend.  After mid-September all sites are available on a first come-first serve basis.  Features include an RV loop with long pull through parking, flush toilets, potable water, and an on-site Forest Service Host.\n\n\u003ch2\u003eRecreation\u003c/h2\u003e\nThis campground is a popular base camp location for hunting, fishing, and OHV riders.  There are a plethora of trails for dirt bikes, jeeps, hiking, mountain biking, and horseback riding near this campground.  \u003ch2\u003eFacilities\u003c/h2\u003e\nThe campground has 25 reservable sites available between Memorial Day weekend and Labor Day weekend.  After, mid-September all sites are available on a first come-first serve basis.  Features include an RV loop with long pull through parking, flush toilets, potable water, picnic tables, campfire rings, trash collection and an on-site Forest Service Host. \u003ch2\u003eNatural Features\u003c/h2\u003e\nThe Little Naches River area is surrounded by a predominately ponderosa pine forest. Okanogan-Wenatchee National Forest offers stunning scenic views, with high, glaciated alpine peaks, valleys of old growth forest and rugged shrub-steppe country making up the diverse landscape. Elevations range from below 1,000 feet to more than 9,000 feet.  Precipitation varies greatly throughout the area, ranging from approximately 140 inches along the Cascade Crest to only 10 inches along the eastern edge. Visitors can expect many days of warm, sunny weather in the summer, and winters with clear skies and plenty of snow.   \nThe area supports wildlife such as deer, squirrels, native fish, black bear and migratory birds.\n\n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nBoulder Cave National Recreation Trail is one of the most popular places in the Naches District. Visitors can walk the accessible trail along the river or explore Boulder Cave. Interpretive signs along the trail explain the geology, plants, animals and fire history of the area.  Visitors will also enjoy traversing the Chinook Scenic Byway, considered one of Washington's premier driving excursions. Spectacular views of Mount Rainier, old-growth forests, alpine peaks, jagged ridges and river canyons dominate this 92-mile journey. In addition to trails open to multiple uses within 10 miles of the campground, there are also opportunities for gold panning, hunting, and fishing.","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":" \nFrom Naches, WA travel west on US Highway 12 for 4.4 miles. Continue straight onto State Route (SR) 410 W for 24.2 miles. Turn north (right) on Little Naches Road / Forest Road 19 and follow for 2.5 miles. The site is on the left side of the road, parallel to the river.\nFrom Enumclaw, WA depart SR 164/Griffin Ave toward Wells St. After ½ mile turn left onto SR 410/Roosevelt Ave. Follow SR 410 approximately 76 miles east to the intersection with Little Naches Road/Forest Road 19. Turn north on FR 19 and follow for 2.5 miles.","FacilityPhone":"509-653-1401","FacilityEmail":"lwormwood@fs.fed.us","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.127162,47.009899]},"FacilityLongitude":-121.127162,"FacilityLatitude":47.009899,"Keywords":"Kaner","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"234027","LegacyFacilityID":"74029","OrgFacilityID":"AN374029","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"LODGEPOLE CAMPGROUND (WA)","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\n\u003cp\u003eLodgepole Campground is located in the Okanogan-Wenatchee National Forest in the Northern Cascade Range of Washington. With the scenic waters of the American River running alongside the site, and access to pristine wilderness, scenic highways and a multitude of recreational activities nearby, the campground offers an ideal setting for outdoor enthusiasts.\u003c/p\u003e\n\n\u003cp\u003ePlease note, this campground IS NOT within Sequoia National Park.\u003c/p\u003e\n\u003ch2\u003eRecreation\u003c/h2\u003e\nLodgepole Campground offers outdoor enthusiasts the opportunity to hike, fish, ski, raft and enjoy a multitude of outdoor recreational activities throughout the year.\n\u003cbr/\u003e\u003cbr/\u003e\nBeautiful rivers and streams, high elevation lakes, reservoirs, and small ponds provide an endless number of fishing opportunities for the experienced and beginning angler. The American River, adjacent to the campground, supports a variety of trout including rainbow, brook, and cutthroat.\n\u003cbr/\u003e\u003cbr/\u003e\nThe river also offers a scenic backdrop for swimmers braving its cold, refreshing waters. Whitewater enthusiasts enjoy rafting on the American or one of the many other rivers in the area.\u003ch2\u003eFacilities\u003c/h2\u003e\nLodgepole Campground offers several standard sites, accomodating both tent and RV camping. Picnic tables, vault toilets and drinking water are available, however there are no electrical hookups.\u003ch2\u003eNatural Features\u003c/h2\u003e\nThe stunning beauty of the Okanogan-Wenatchee National Forest attracts visitors from throughout the country, with its high, glaciated alpine peaks towering along the Cascade Crest. Lush valleys of old-growth forest define its western boundary and at its eastern edge, rugged shrub-steppe country comprises a more arid region. Elevations range from below 1,000 feet to over 9,000 feet.\n\u003cbr/\u003e\u003cbr/\u003e\nPrecipitation varies greatly thoughout the area, ranging from approximately 140 inches along the Cascade Crest to only 10 inches along the eastern edge. Visitors can expect many days of warm, sunny weather in the summer and clear skies and plenty of snow in the winter.\n\u003cbr/\u003e\u003cbr/\u003e\nNearby Goat Rocks Wilderness is an exciting adventure for those wanting to traverse higher elevations. Peaks within the area are remnants of an extinct volcano, taking the name \"Goat Rocks,\" in honor of the numerous mountain goats traversing this isolated region. Gilbert Peak is the highest summit in this area at an elevation of 8,184 feet.\n\u003ch2\u003econtact_info\u003c/h2\u003e\nThis location has limited staffing. Please call (661) 702-1420 for general information.\n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nCrow Lake, Swamp Lake, Cougar Valley and Union Creek Trails all have trailheads near Lodgepole Campground. Hikers may also want to traverse at least a portion of the spectacular Pacific Crest Trail (PCT), one of the world's premier National Scenic Trails.\n\u003cbr/\u003e\u003cbr/\u003e\nBoulder Cave National Recreation Trail is one of the most popular places in the Naches District. Visitors can walk the accessible trail along the river or explore Boulder Cave. Interpretive signs along the trail explain the geology, plants, animals and fire history of the area.\n\u003cbr/\u003e\u003cbr/\u003e\nNearby Mount Rainier National Park offers fantastic glimpses of glaciers, subalpine ecology and volcanic landscapes.","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"From Yakima, take Highway 12 west to the junction with Highway 410. Travel 39 miles on Highway 410 to the campground entrance.","FacilityPhone":"541-338-7869","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.3844444,46.9158333]},"FacilityLongitude":-121.3844444,"FacilityLatitude":46.9158333,"Keywords":"LDPL,OKANOGAN - WENATCHEE NF -FS,LODGEPOLE,LODGEPOLE CAMPGROUND","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"274185","LegacyFacilityID":"","OrgFacilityID":"59431","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"Slate Peak Trailhead","FacilityDescription":"\u003cp\u003e\u003cstrong\u003eProvides access to: \u003c/strong\u003eWest Fork Pasayten River Trail #472 within \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recarea/?recid=79431\"\u003ePasayten Wilderness\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eSlate Peak Trailhead near Slate Peak, above Harts Pass. Small parking area.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Winthrop, WA take State Route 20 west for 13 miles, turn right on paved Lost River Road and travel 7.5 miles. Then continue on gravel Forest Road 5400 to Harts Pass then turn right and follow spur road uphill to pass Pacific Crest Trailhead (at first switchback), Slate Pass (at second switchback) to arrive at Slate Peak trailhead at the gate near end of the road.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-120.6785,48.737833]},"FacilityLongitude":-120.6785,"FacilityLatitude":48.737833,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"274048","LegacyFacilityID":"","OrgFacilityID":"58699","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"Chikamin ORV Trailhead","FacilityDescription":"\u003cp\u003eThis trailhead provides access to the \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recreation/hiking/recarea/?recid=58891\u0026actid=50\"\u003eMinnow Ridge ORV Trail #1524\u003c/a\u003e, \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recreation/hiking/recarea/?recid=58697\u0026actid=50\"\u003eChikamin Creek ORV Trail #1534\u003c/a\u003e, and \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recreation/hiking/recarea/?recid=58875\u0026actid=50\"\u003eLower Chiwawa ORV Trail #1548\u003c/a\u003e.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Leavenworth, WA, take US-2 West for about 15 miles. Turn right onto WA-207 North and travel 4.4 miles. Turn right onto Chiwawa Loop Road and go about 0.5 mile. Stay right to go onto County Highway 22 and travel 0.8 mile. Take the second left onto Chiwawa River Road/Forest Road 6200. Follow Chiwawa River/Forest Road 6200 for about 9.4 miles. Turn right onto Chikamin Ridge Road/Forest Road 6210. Follow this road for about 1 mile, and the trailhead will be on your right.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-120.7177,47.916655]},"FacilityLongitude":-120.7177,"FacilityLatitude":47.916655,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"265464","LegacyFacilityID":"","OrgFacilityID":"67912","ParentOrgID":"131","ParentRecAreaID":"1116","FacilityName":"Thirteen Mile Trailhead","FacilityDescription":"\u003cp\u003eLocated just off highway 21, this rustic trailhead offers access for larger vehicles, or trailers. Lots of space to get ready for the trail. There is a stock ramp and hitching post.\u003c/p\u003e\u003cp\u003eProvides access to:\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003ca href=\"http://www.fs.usda.gov/recarea/colville/recreation/recarea/?recid=67910\"\u003eThirteen Mile Trail #23\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003e\u003cstrong\u003eFrom Republic, WA\u003c/strong\u003e:  Take highway 21 south 13 miles to the trailhead.  The trailhead is located on the left side of the road, at the boundary of the Colville Indian Reservation.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.google.com/maps/dir/Republic,+WA/'48.48189,-118.7273'/@48.5697681,-118.7782565,149749m/data=!3m2!1e3!4b1!4m11!4m10!1m5!1m1!1s0x549d6ea629f11965:0x5905f1f1bf44886d!2m2!1d-118.7378067!2d48.6482183!1m3!2m2!1d-118.7273!2d48.48189\"\u003eGoogle map directions from Republic, WA\u003c/a\u003e\u003c/p\u003e\u003cp\u003eLatitude 48.481887 Longitude -118.504999\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-118.727262,48.481887]},"FacilityLongitude":-118.727262,"FacilityLatitude":48.481887,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2021-04-06"},{"FacilityID":"274145","LegacyFacilityID":"","OrgFacilityID":"59191","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"Driveway Butte Trailhead","FacilityDescription":"\u003cp\u003eForested trailhead, near the entrance to \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recarea/?recid=59281\"\u003eKlipchuck Campground\u003c/a\u003e gives access to \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recarea/?recid=59189\"\u003eDriveway Butte Trail #481\u003c/a\u003e.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Winthrop, Washington travel west on Highway 20 for about 18 miles. Then turn right onto Forest Road 300 and follow for about 0.6 miles, to trailhead on right.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-120.51341,48.59838]},"FacilityLongitude":-120.51341,"FacilityLatitude":48.59838,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"274119","LegacyFacilityID":"","OrgFacilityID":"59055","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"Upper Mill Creek Snowplay Area","FacilityDescription":"Upper Mill Creek Snowplay Area","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"","COORDINATES":null},"FacilityLongitude":0,"FacilityLatitude":0,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"234022","LegacyFacilityID":"74023","OrgFacilityID":"AN374023","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"SAWMILL FLAT CAMPGROUND","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\nSawmill Flat Campground is located along the Naches River in the Northern Cascade Range of Washington.\u003cbr/\u003e\u003cbr/\u003e \n\nThe campground provides and ideal setting for both individual and family camping excursions.\u003ch2\u003eRecreation\u003c/h2\u003e\nOkanogan-Wenatchee National Forest offers a multitude of recreational activities for its visitors.\u003cbr/\u003e\u003cbr/\u003e \n\nIn addition to being a prime location for hiking, fishing, hunting, horseback riding and mountain biking in summer and early fall, \nthe area provides excellent skiing and snowshoeing in the winter.\u003cbr/\u003e\u003cbr/\u003e\n\nHikers and backpackers are especially fortunate to have access to a variety of spectacular trails near the campground and in the \n\nsurrounding areas. Designated Wilderness provides thousands of pristine acres of incredible landscapes to enjoy in solitude or with a small group.\u003cbr/\u003e\u003cbr/\u003e \n\nFrost Mountain Lookout Trail is a favorite for many in the area, and river enthusiasts may enjoy a whitewater paddle on the nearby American River.\u003ch2\u003eFacilities\u003c/h2\u003e\nSawmill Flats Campground offers standard, tent only, and walk up sites.\u003cbr/\u003e\u003cbr/\u003e \n\nVault toilets and drinking water are available, however there are no electrical hook-ups.\u003ch2\u003eNatural Features\u003c/h2\u003e\nBecause of its wide geographic range, the Okanogan-Wenatchee is a stunning and unique National Forest. High, glaciated alpine peaks tower along the Cascade Crest. Lush valleys of old growth forest define its western boundary. And, at its eastern edge, rugged shrub-steppe country comprises a more arid region. \n\u003cbr/\u003e\u003cbr/\u003e\nElevations range from below 1,000 ft. to over 9,000 ft.\u003cbr/\u003e\u003cbr/\u003e  \n\nThe Naches River, adjacent to Sawmill Flat Campground, is a tributary of the Yakima River in central Washington. In its upper reaches the river flows through rugged terrain and areas of pristine wilderness. Before joining the Yakima River it makes its way through valleys and is a significant irrigation source for areas northwest of Yakima.\u003cbr/\u003e\u003cbr/\u003e\n\nUsed by Native Americans and settlers throughout history, the river has served as an natural corridor between the east and west sides of the Cascades through the Naches Pass.\n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nBoulder Cave National Recreation Trail is one of the most popular places in the District. Visitors enjoy the accessible trail along the river or hiking to Boulder Cave. Interpretive signs along the trail explain the geology, plants, animals and fire history of the area.\u003cbr/\u003e\u003cbr/\u003e \n\nIn the fall thousands of people come to experience white water rafting on both the Tieton and American Rivers. Hikers may want to traverse at least a portion of the spectacular Pacific Crest Trail (PCT), one of the world's premier National Scenic Trails.  This trail showcases some of North America's most fantastic scenery, winding its way its way from Mexico to Canada through California, Oregon and Washington.  \n\u003ch2\u003econtact_info\u003c/h2\u003e\nThis location has limited staffing. Please call (661) 702-1420 for general information.","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"\u003cb\u003e From Spokane, Washington,\u003c/b\u003e take I-90 west toward Seattle. Continue for 170 miles, then take exit 110 to merge onto I-82 east. After nearly 32 miles, take exit 31A-31B to merge onto US-12 west and follow for about 25 miles. Turn left onto Nile Road, then left onto WA-410 west. The campground will be on the left.","FacilityPhone":"541-338-7869","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.0952778,46.9744444]},"FacilityLongitude":-121.0952778,"FacilityLatitude":46.9744444,"Keywords":"SAWM,BOULDER CAVE,OKANOGAN - WENATCHEE NF -FS,SAWMILL FLAT,SAWMILL FLAT CAMPGROUND","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"266316","LegacyFacilityID":"","OrgFacilityID":"72064","ParentOrgID":"131","ParentRecAreaID":"1116","FacilityName":"Lake Ellen","FacilityDescription":"\u003cp\u003e\u003ca href=\"http://www.fs.usda.gov/photogallery/colville/?cid=2968\"\u003e\u003cimg alt=\"Lake Ellen\" src=\"http://www.fs.usda.gov/Internet/FSE_MEDIA/stelprdb5289199\" style=\"margin: 5px 10px 5px 5px; float: left\" width=\"518\"/\u003e\u003c/a\u003eLake Ellen is 78 acres and can be found in a setting of rock outcropings and timber. Stunning views and accessible dock fishing make this a lake the whole family can enjoy. \u003c/p\u003e\u003cp\u003e\u003cem\u003eHistory:\u003c/em\u003e In the 1880’s, logging and lumbering practices in the Pacific Northwest was on the rise. As trees were being used up in one area the need for building materials was expanding and populations began moving westward. This lumber boom was known to historians as “the Westward Movement.” By 1910, over 100 sawmills were in Stevens County. Competition between small operators became more difficult as power was almost completely mechanized; motorized trucks and log trucks replaced horses and the railroad living as a logger or lumberman during the Westward Movement was not easy to say the least, often sharing 20 men bunkhouses at designated mill camps. One of two mill camps in Ferry County was at Lake Ellen, and the other was on Barnaby Creek.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003e\u003cstrong\u003eFrom Kettle Falls, WA\u003c/strong\u003e:  Head west on US-395 N/WA-20 W/E 3rd Ave toward Meyers St Continue to follow US-395 N/WA-20 W for 3.7 miles.  Turn left onto WA-20 W for 4.1 miles.  Turn left onto Inchelium Kettle Falls Rd for 4.5 miles.  Turn right onto Lake Ellen Rd for 3.0 miles. \u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.google.com/maps/dir/Kettle+Falls,+WA/Lake+Ellen+Rd,+Kettle+Falls,+WA+99141/@48.5681404,-118.2102699,12z/am=t/data=!3m1!4b1!4m13!4m12!1m5!1m1!1s0x5362840988827b4f:0x8a854fbe7b65ea38!2m2!1d-118.0558218!2d48.6107354!1m5!1m1!1s0x549d7ec4b4d3a75b:0xed3341c4162361c2!2m2!1d-118.2167412!2d48.5086653\"\u003eGoogle map directions from Kettle Falls, WA\u003c/a\u003e\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-118.255129,48.498507]},"FacilityLongitude":-118.255129,"FacilityLatitude":48.498507,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-19"},{"FacilityID":"233247","LegacyFacilityID":"72173","OrgFacilityID":"AN372173","ParentOrgID":"130","ParentRecAreaID":"262","FacilityName":"Rooks Park (WA) Bennington Lake","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\nRooks Park is located 10 minutes east of Walla Walla, Washington. This 18-acre developed park offers visitors a wide variety of recreational opportunities. \u003ch2\u003eRecreation\u003c/h2\u003e\nRooks Park's grassy spaces provide the ideal place for family picnics and games of volleyball, football or Frisbee. Visitors also enjoy cooling their feet in the creek.\u003ch2\u003eFacilities\u003c/h2\u003e\nThis day-use area is open year-round to foot traffic, and April to mid-October to vehicles. A group picnic shelter is available for reservations and can accommodate up to 75 people. \u003cbr /\u003e\u003cbr /\u003e\nAmenities include flush toilets, drinking water, a playground, sand volleyball court and horseshoe pit.\u003ch2\u003eNatural Features\u003c/h2\u003e\nThe park consists of large open spaces and smaller secluded areas for groups and families alike. Large trees and irrigated lawns offer shade and relief from Walla Walla's hot summer days.\n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nBennington Lake is less than 10 minutes from Rooks Park. It is the only public lake in the Walla Walla Valley, covering approximately 52 surface acres. Throughout the spring, the lake is stocked with rainbow trout to enhance angling opportunities. ","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"From Walla Walla, take Highway 12 East. Exit at Airport Way and turn right onto Airport Way. Drive .25 miles then turn left onto East Isaacs Ave. Continue onto Mill Creek Rd in .75 miles. Drive .5 miles then turn right onto Rooks Park Rd. Continue .25 miles to park.","FacilityPhone":"509-527-7160","FacilityEmail":"MillCreek@usace.army.mil","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-118.255,46.0805556]},"FacilityLongitude":-118.255,"FacilityLatitude":46.0805556,"Keywords":"Bennington Lake,Mill Creek Project,Rooks Park,Mill Creek Lake,Mill Creek Trails,Walla Walla,Mill Creek,Mill Creek Dam,. Rook,Rooks","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"234215","LegacyFacilityID":"75063","OrgFacilityID":"AN375063","ParentOrgID":"131","ParentRecAreaID":"1118","FacilityName":"SUIATTLE GUARD STATION","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\nSet near the Suiattle River and surrounded by mountain peaks and old-growth forest, the Suiattle Guard Station (pronounced \u0026quot;Sue-attle\u0026quot;) is a historic log cabin that was constructed in 1913 by \nTommy Thompson, Assistant Ranger of the Suiattle-Finney District, to house a forest guard.\u003cbr /\u003e\u003cbr /\u003e\n \nBecause of budget limitations at that time, the Forest Service often relied upon rangers to construct their own stations. It is a testament to Ranger Thompson`s skill \nthat the cabin survives to this day as one of the oldest administrative buildings in the Mt. Baker-Snoqualmie National Forest. The Suiattle Guard Station was placed \non the National Register of Historic Places in 1990.\u003cbr /\u003e\u003cbr /\u003e\n\nThe cabin is accessible by car. Many creature comforts are provided, but guests will need to bring a few of their own amenities to ensure a comfortable and enjoyable\nstay. \u003ch2\u003eRecreation\u003c/h2\u003e\nSeveral hiking and equestrian trails crisscross the area, which are accessible from Suiattle River Road (Forest Service Road 26). Anglers can also find fishing spots nearby.\u003cbr /\u003e\u003cbr /\u003e\n\nFederally protected under the Wild and Scenic Rivers Act, the Suiattle River is popular among whitewater enthusiasts. River runners paddle Class 2 and 3 rapids through lush forested scenery, with views of nearby snow-capped peaks. Since the headwaters of the river originate at a glacier, the water has a milky appearance. July and August are the best times for rafting.\u003ch2\u003eFacilities\u003c/h2\u003e\nThe cabin can accommodate four people with one full size bed with mattress and one futon. Other amenities include a table, two benches, two chairs, a propane \nrefrigerator, stove, lantern, cookware, dishes, utensils, water heater and a wood stove. A bathroom with a shower and flush toilet is located at the back of the guard station, and a primitive vault toilet is located \n20 feet from the building. Firewood is available outside the cabin.\u003cbr /\u003e\u003cbr /\u003e \n\nThere is room on-site for up to four tents and two RVs. No electrical hook-ups are available. The water source to the building consists of a spring that is run \ninto a small collection box on the hillside behind the cabin and piped into the building. This water is not drinkable and is to be used only for the toilet.\u003cbr /\u003e\u003cbr /\u003e  \n\nDrinking water is not available. Guests must bring enough water for drinking, cooking, and washing.\u003cbr /\u003e\u003cbr /\u003e\n\nPropane canisters are not provided for the lantern, so guests must bring their own propane canisters. Other items to bring include food, a backup light source, \nsleeping bags, towels, dish soap, matches, a first aid kit, toilet paper and garbage bags. All trash and food must be packed out, and guests are expected to clean the\ncabin before leaving.\n \n\u003ch2\u003eNatural Features\u003c/h2\u003e\nHemmed in by several designated wilderness areas, the Mt. Baker-Snoqualmie National Forest showcases rugged peaks, sparkling alpine lakes and old-growth forests. The charming log cabin sits on a gently sloping lawn at the edge of the forest.\u003cbr /\u003e\u003cbr /\u003e\n\nNearby Mt. Baker, the most prominent feature of the Mt. Baker Wilderness Area, dominates the landscape on a clear day.  Rising to an elevation of 10,781 feet, the active volcano from which the forest takes its name is perpetually snow-capped and mantled with an extensive network of creeping glaciers. Mt. Baker's summit, Grant Peak, is actually a mound of ice 1,300 feet deep, which hides a massive volcanic crater.\u003cbr /\u003e\u003cbr /\u003e\n\nWildlife is abundant, and guests may catch a glimpse of black bears, bobcats, elk or bald eagles. Wolves are making a comeback to the area, but they are usually heard and not seen. \n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nDarrington, located 26 miles from the cabin, has a grocery store, sporting goods store and gas station for last minute items.","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"The Guard Station is located approximately 26 miles northeast of Darrington. Travel northeast on Highway 530 about 7 miles from Darrington and turn right (east) onto Forest Service Road 26/Suiattle River Road. This is a gravel road. The cabin is located about 19 miles on Forest Road 26.","FacilityPhone":"541-338-7869","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.3172222,48.2619444]},"FacilityLongitude":-121.3172222,"FacilityLatitude":48.2619444,"Keywords":"SUIT,MT. BAKER-SNOQU NF - FS","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"10078692","LegacyFacilityID":"","OrgFacilityID":"58611","ParentOrgID":"131","ParentRecAreaID":"","FacilityName":"White Pass Day Use/Boat Launch/Trailhead","FacilityDescription":"\u003cp\u003eWhite Pass Lake (Leech Lake) is a popular fly fishing lake as well as a traihead for access to the Pacific Crest National Scenic Trail that accesses \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recarea/?recid=79426\"\u003eWilliam O. Douglas Wilderness.\u003c/a\u003e\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Packwood WA head east on US-12 for about 21 miles to White Pass Lake (Leech Lake). Take Forest Road 498 and follow road around end of lake to trailhead and boat launch.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.381,46.645]},"FacilityLongitude":-121.381,"FacilityLatitude":46.645,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2021-02-03"},{"FacilityID":"246009","LegacyFacilityID":"","OrgFacilityID":"56481","ParentOrgID":"131","ParentRecAreaID":"1111","FacilityName":"Blue Mountain Byway East Interpretive Site","FacilityDescription":"\u003cp\u003eThe\u0026nbsp;Blue Mountain Byway East Interpretive Site is located on Forest Road \u0026nbsp;73 at the east end portal to the Blue Mountain Scenic Byway and it\u0026#39;s junction with the Elkhorn Scenic Byway. \u0026nbsp;The interpretive site is just south of the North Fork John Day Campground. \u0026nbsp;A picnic table is set below the kiosk in the trees for day use.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-118.400572,44.913238]},"FacilityLongitude":-118.400572,"FacilityLatitude":44.913238,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"251884","LegacyFacilityID":"136241","OrgFacilityID":"AN436241","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"AMERICAN FORKS CAMPGROUND","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\nAmerican Forks Campground is located about 40 miles west of Naches, Washington, near the American River and Bumping River in the East Cascade mountains.\u003ch2\u003eRecreation\u003c/h2\u003e\nThe campground setting provides ready access to Bumping Lake, where boating and fishing are popular. Hiking and horseback riding trails extend into the William O. Douglas and Norse Peak Wilderness areas, and off-road vehicle and snowmobile access draws visitors to the Little Naches drainage. In winter, snow-shoeing and cross-country skiing are popular in the American River area.   A trip along the scenic Mather Parkway is a fantastic outing. The American River, adjacent to the campground, offers a scenic backdrop for anglers.  Its cold, clear waters sustain populations of rainbow and brown trout.   Whitewater enthusiasts may enjoy a paddle on the river or one of the many other tributaries draining into the Cascade region.\u003ch2\u003eFacilities\u003c/h2\u003e\nThe campground has 8 reservable sites and 4 first-come, first-served sites available between Memorial Day and the end of September. There is no water available at the campground, however, vault toilets are provided. \u003ch2\u003eNatural Features\u003c/h2\u003e\nThe Okanogan-Wenatchee National Forest is defined by its diverse landscapes, boasting high glaciated alpine peaks, lush valleys of old growth forest, and rugged shrub-steppe country. The American Forks Campground is nestled in an old-growth forest of Douglas fir, western hemlock, and a cedar under story with grassy areas, ferns, and mosses.  With the William O. Douglas and Norse Peak Wilderness areas nearby, the location is home to abundant wildlife, including deer, elk, porcupine, native fish, and migratory birds.  Endangered and threatened species, including the northern spotted owl, gray wolves, and grizzly bears also find havens in local ecosystems.   Summer temperatures are generally sunny and warm with little precipitation, and winters boast mostly clear skies, but plenty of snow.  \n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nHikers may want to traverse a portion of the spectacular Pacific Crest Trail (PCT), one of the world's premier National Scenic Trails. Enjoy some of North America's most fantastic scenery, as the trail winds from Mexico to Canada through Washington state.   Boulder Cave Trail is one of the most popular places in the Naches District. Visitors can walk the accessible trail along the river or explore Boulder Cave. Interpretive signs along the trail explain the geology, plants, animals and history of the area.  In addition to hiking, there are a plethora of outdoor activities available within 10 miles of this campground.  The list includes lake access with a marina, boat ramp, and dock, mountain biking, off highway vehicle trails,historic sites, horseback riding trails, scenic driving, hunting and fishing. ","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":" From Naches, WA travel west on US Highway 12 for 4.4 miles. Continue straight onto State Route (SR) 410 W for 27.5 miles. Turn left onto Bumping River Rd / Forest Road 1800. Turn left on Bumping River Road, cross the bridge over the American River, then turn left onto the American Forks Campground Road. From Enumclaw depart SR 164/Griffin Ave toward Wells St. After ½ mile turn left onto SR 410/Roosevelt Ave. Follow SR 410 approximately 66 miles east to the intersection with Bumping River Road (FR 1800). Turn right on Bumping River Road, cross the bridge over the American River, then turn left onto the American Forks Campground Road.","FacilityPhone":"(509) 653-1401","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.1624306,46.9773417]},"FacilityLongitude":-121.1624306,"FacilityLatitude":46.9773417,"Keywords":"","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"10078676","LegacyFacilityID":"","OrgFacilityID":"56741","ParentOrgID":"131","ParentRecAreaID":"","FacilityName":"Godman Campground/Trailhead","FacilityDescription":"\u003cp\u003eGodman Campground has several secret treasures. There are numerous recreation opportunities available at this campground such as hunting, fishing, bicycling, and hiking. This campground location offers good views and great sunsets. The nearby Godman Trailhead provides access to \u003ca href=\"http://www.fs.usda.gov/recarea/umatilla/recarea/?recid=56901\"\u003e\u003cstrong\u003eWest Butte Trail #3138\u003c/strong\u003e\u003c/a\u003e which enters \u003ca href=\"http://www.fs.usda.gov/recarea/umatilla/recarea/?recid=56927\"\u003e\u003cstrong\u003eWenaha-Tucannon Wilderness\u003c/strong\u003e\u003c/a\u003e. Please \u003ca href=\"http://lnt.org/learn/7-principles\" target=\"_blank\"\u003e\u003cstrong\u003eLeave-No-Trace\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003e\u003cstrong\u003eFrom Dayton, Washington (64 minutes): \u003c/strong\u003eHead west on Patit Road toward east Main Street. Take a left turn onto east Main Street. In 1.5 miles turn left onto South 4\u003csup\u003eth\u003c/sup\u003e Street. For 3.5 miles continue onto north Touchet Road. In 4.4 miles turn left onto Hatley Gulch Road. Make a slight right turn onto Eckler Mountain Road/ Kendall Skyline Road. In 5.9 miles turn right onto Kendall Skyline Road/ Skyline Drive. In 11.7 miles Godman Campground will be on your right.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-117.786291,46.099718]},"FacilityLongitude":-117.786291,"FacilityLatitude":46.099718,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2021-02-03"},{"FacilityID":"232407","LegacyFacilityID":"70815","OrgFacilityID":"AN370815","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"MINERAL SPRINGS GROUP","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\n\u003cp\u003eAt an elevation of 2,500 feet, Mineral Springs Group Campground sits in the mountainous terrain of the Okanogan-Wenatchee National Forest in northern Washington.    \u003cbr\u003e\u003cbr\u003eNearby peaks and old-growth forests provide visitors with a variety of scenic landscapes. \u003c/p\u003e\n\u003ch2\u003eRecreation\u003c/h2\u003e\n\u003cp\u003eThe area around Mineral Springs is a prime location for hiking, horseback riding and mountain biking in summer and early fall, and offers opportunities for skiing, snowshoeing and snowmobiling in the winter months.  \u003cbr\u003e\u003cbr\u003eThe campground is a great base camp for day-hikers and overnight backpackers, and several access trails are available from the area.   \u003cbr\u003e\u003cbr\u003e\u003c/p\u003e\n\u003ch2\u003eFacilities\u003c/h2\u003e\nMineral Spring Campground offers eight first-come first-serve single family sites and one reservable group site that can accommodate up to 50 guests. The sites are equipped with tables and campfire rings with grills. Vault toilets and drinking water are also available on site.\u003ch2\u003eNatural Features\u003c/h2\u003e\nThe Okanogan-Wenatchee National Forest features high, glaciated alpine peaks towering along the Cascade Crest. Lush valleys of old growth forest define its western boundary, and at its eastern edge, rugged shrub-steppe country comprises a more arid region.    \n\nMount Stuart, a towering mass of granite located in the nearby Alpine Lakes Wilderness area, is the second highest non-volcanic peak in Washington, perched at an elevation of 9,415 feet.  \n\nThe surrounding undeveloped wilderness, clean streams and diverse forests support an abundance of wildlife, including deer, porcupine, native fish and migratory birds.\n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\n\u003cp\u003eNearby Red Top Mountain is a popular excursion for those wanting to reach a vista point after a short hike. Perched atop a basalt outcrop is Red Top Fire Lookout, where on a clear day visitors are treated to spectacular views of Mt. Stuart, Mt. Rainier and the Teanaway Valley. July through mid-September the historic lookout is often open to visitors. \u003c/p\u003e\n\n\u003ch2\u003econtact_info\u003c/h2\u003e\nThis location has limited staffing. Please call (661) 702-1420 for general information.","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"Located on Highway 97, about 21 miles northeast of Cle Elum, Washington. The group camping area is to the left after crossing the bridge into the campground.","FacilityPhone":"509-852-1100","FacilityEmail":"briandspeeg@fs.fed.us","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-120.6977778,47.2927778]},"FacilityLongitude":-120.6977778,"FacilityLatitude":47.2927778,"Keywords":"MINE,OKANOGAN - WENATCHEE NF -FS","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"273938","LegacyFacilityID":"","OrgFacilityID":"57515","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"French Cabin Creek Recreation Area","FacilityDescription":"\u003cp\u003eThis dispersed camping area is located along the west bank of the Cle Elum River north of Cle Elum Lake and is accessed by Forest Service Road 4308.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.1146,47.354401]},"FacilityLongitude":-121.1146,"FacilityLatitude":47.354401,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"244687","LegacyFacilityID":"","OrgFacilityID":"74276","ParentOrgID":"131","ParentRecAreaID":"1117","FacilityName":"Forest Road 59","FacilityDescription":"\u003cp\u003eForest Road 59 travels north from Hwy 706\u0026nbsp;along the west side of Mount Rainier National Park.\u0026nbsp;\u003c/p\u003e\u003cp\u003eThe road\u0026nbsp;provides access to the Glacier View Wilderness Trails\u0026nbsp; including Lake Christine and Mt. Beljica.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"","COORDINATES":null},"FacilityLongitude":0,"FacilityLatitude":0,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"232799","LegacyFacilityID":"71574","OrgFacilityID":"AN371574","ParentOrgID":"131","ParentRecAreaID":"1117","FacilityName":"Moss Creek campground","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\nLocated in the southeast corner of the Gifford-Pinchot National Forest and close to Columbia River Gorge, Moss Creek Campground sits alongside the Little White Salmon River. At an elevation of 1,400 feet, the campground is shaded by a thick canopy of hemlock, cedars, firs and maples. Moss Creek is ideal for those wishing to escape the summer heat.\u003ch2\u003eRecreation\u003c/h2\u003e\nThe Little White Salmon River offers rainbow and brook trout for anglers. Visitors can enjoy wading in the cool waters.\n\u003ch2\u003eFacilities\u003c/h2\u003e\n\u003cp\u003eThis small campground has 16 sites that are ideal for tents but useable by smaller RVs and trailers.\u003cbr\u003e\u003cbr\u003e \u003cbr\u003e\u003cbr\u003eDrinking water and vault toilets are available. Picnic tables and fire rings are provided, and firewood can be purchased on-site.\u003c/p\u003e\n\u003ch2\u003eNatural Features\u003c/h2\u003e\nLocated in southwest Washington State, the Gifford Pinchot National Forest encompasses 1.3 million acres and includes the 110,000-acre Mount St. Helens National Volcanic Monument, established by Congress in 1982.\u003cbr/\u003e\u003cbr/\u003e\n\nMoss Creek is located in the Mount Adams Ranger District in the easternmost portion of the Gifford Pinchot National Forest. Mount Adams is a prominent landmark on the District, where elevations range between 1,200 and 12,276 feet.\u003cbr/\u003e\u003cbr/\u003e \n\nThe District features a great diversity of habitats, from old growth to second growth forest, wetland areas, low and high elevation meadows, glaciers and low and high elevation lakes.\n\u003ch2\u003econtact_info\u003c/h2\u003e\nThis location has limited staffing. Please call (509) 538-2060 for general information.\n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nMoss Creek Campground is an excellent base for exploring the various sights around Mount Adams and the Columbia River Gorge. \n","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom I-5 at Vancouver, WA, turn east on Highway 14 for 56 miles to Cook. Turn north on Cook-Underwood Rd, drive 5 miles then turn left onto Willard Road, drive 2+ miles continue onto Oklahoma Rd, drive  under 1 mile Campground is on your right. \u003c/p\u003e\n\n","FacilityPhone":"541-338-7869","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.6391667,45.7977778]},"FacilityLongitude":-121.6391667,"FacilityLatitude":45.7977778,"Keywords":"MOSS,GIFFORD PINCHOT NF - FS","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"244648","LegacyFacilityID":"","OrgFacilityID":"32162","ParentOrgID":"131","ParentRecAreaID":"1117","FacilityName":"Site: Walupt Lake Day Use Picnic Area","FacilityDescription":"\u003cp\u003eWithin \u003ca href=\"http://www.fs.usda.gov/recarea/giffordpinchot/recreation/recarea/?recid=31460\"\u003eWalupt Lake Campground\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThe Lake has a primitive boat ramp and day use area great for swimming and hanging out a hot summer day. Mosquitos can be a problem early in the season. There are numerous trails nearby. \u003ca href=\"http://www.fs.usda.gov/recarea/giffordpinchot/recarea/?recid=31462\"\u003eWalupt Lake Trail # 101\u003c/a\u003e goes along the northern edge of the lake and is an easy hike to the end of the lake. The \u003ca href=\"http://www.fs.usda.gov/recarea/giffordpinchot/recarea/?recid=31364\"\u003eNanny Ridge Trail # 98\u003c/a\u003e climbs steeply but offers great views of the Goat Rocks Wilderness. Be sure to fill out a Wilderness Permit before entering the Wilderness.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.472677,46.423751]},"FacilityLongitude":-121.472677,"FacilityLatitude":46.423751,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"273917","LegacyFacilityID":"","OrgFacilityID":"57257","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"Lucerne Campground","FacilityDescription":"\u003cp\u003eThis boat-in campground adjacent to a Forest Service Guard Station offers a dock and boat basin with an eleven boat capacity. A ¼-mile trail connects to \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recreation/camping-cabins/recarea/?recid=57325\u0026actid=29\"\u003eRefrigerator Harbor Campground\u003c/a\u003e \u0026 road to Holden Village.\u003cbr/\u003e \u003c/p\u003e\u003cp\u003eOpen for \u003cstrong\u003eDAY USE ONLY\u003c/strong\u003e, Overnight camping is prohibited. \u003c/p\u003e","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Chelan, boat approximately 40 miles to Lucerne Landing (there are no roads that connect the City of Chelan to Lucerne). Lucerne Campground is on the south shore adjacent to Forest Service Guard Station.\u003c/p\u003e\u003cp\u003eOR\u003c/p\u003e\u003cp\u003eFrom Chelan, travel south on Highway 97 Alternate for 3 miles. Turn right onto Southshore Road and go approximately 17 miles to Twenty-Five Mile Creek State Park. From the Twenty-Five Mile Creek State Park boat launch, boat uplake approximately 25 miles to Lucerne.\u003c/p\u003e\u003cp\u003eNotes:\u003cbr/\u003eThe Lady of the Lake provides passenger ferry service from Chelan to Stehekin with stops available at Fields Point, Prince Creek, Moore Point, and Lucerne. Please check their website for availability, fees, and scheduling: \u003ca href=\"http://www.ladyofthelake.com\"\u003eladyofthelake.com\u003c/a\u003e.\u003cbr/\u003eTwenty-Five Mile Creek State Park is a popular boat launch for accessing many up lake recreation sites via personal boat. Please check their website for amenities, fees, and schedule: \u003ca href=\"http://www.parks.wa.gov/293/Twenty-Five-Mile-Creek\"\u003eparks.wa.gov/293/Twenty-Five-Mile-Creek\u003c/a\u003e\u003cbr/\u003e \u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-120.589,48.2016]},"FacilityLongitude":-120.589,"FacilityLatitude":48.2016,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"244634","LegacyFacilityID":"","OrgFacilityID":"32126","ParentOrgID":"131","ParentRecAreaID":"1117","FacilityName":"Trailhead: Sleeping Beauty","FacilityDescription":"\u003cp\u003e\u003cstrong\u003eProvides access to\u003c/strong\u003e: \u003ca href=\"http://www.fs.usda.gov/recarea/giffordpinchot/recarea/?recid=31918\"\u003eSleeping Beauty Peak Trail #37\u003c/a\u003e\u003c/p\u003e\u003cp\u003eParking for 3 vehicles.\u0026nbsp; Limited turn-around space.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Trout Lake, Wa take State Highway 141 West to Forest Road 88 to 8810, to 8810-040 then Trail #37 begins on the north side of Road 040 approximately 0.25 mile northwest of the junction with Road 8810.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.658147,46.085024]},"FacilityLongitude":-121.658147,"FacilityLatitude":46.085024,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"274242","LegacyFacilityID":"","OrgFacilityID":"79427","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"Glacier Peak Wilderness: Okanogan-Wenatchee","FacilityDescription":"\u003cp\u003eThe 566,057 acre Glacier Peak Wilderness is located in the northern Cascade Mountains of Washington State bordering Stephen Mather Wilderness to the north and Henry M. Jackson Wilderness to the south. At 10,541 feet, Glacier Peak is the dominant geologic feature of the area. It’s the most remote major volcanic peak in the Cascade Range and has more active glaciers than any other place in the lower forty-eight states. Glacier Peak is a volcanic cone of basalt, pumice, and ash which erupted during periods of heavy glaciation.\u003c/p\u003e\u003cp\u003eThe area is characterized by heavily forested stream courses, steep-sided valleys, and rugged glacier covered peaks. Forest vegetation is comprised of true firs, spruce, and hemlock, as well as stands of pine on its eastern slopes. Various species of wildlife inhabit the area and include deer, elk, bear, mountain goat, cougar, marten, and lynx. This area also provides habitat for wolverines and gray wolves. The primary fishery is cutthroat trout. Numerous creeks cut through the valleys from their sharp drainages. Other bodies of water include more than 200 lakes, many unnamed and tremendously difficult to access. Snows can accumulate to depths of 45 feet on the west side of the crest.\u003c/p\u003e\u003cp\u003eThe ~450 miles on as many as 100 trails vary from relatively easy hiking on maintained footpaths to strenuous and seldom used old animal trails. The Pacific Crest National Scenic Trail (PCT) follows the crest through the area for about 60 miles. The Suiattle River Trail acts as the main route from the west side, a pathway that travels 10.8 miles and joins the PCT. Above timberline, the land opens up for cross-country travel. The Ptarmigan Traverse, probably the most famous un-trailed route, combines rock climbing and glacier travel across 15 miles of the northern section of the Wilderness.\u003c/p\u003e\u003cstyle type=\"text/css\"\u003e.embed-container {position: relative; padding-bottom: 80%; height: 0; max-width: 100%;} .embed-container iframe, .embed-container object, .embed-container iframe{position: absolute; top: 0; left: 0; width: 100%; height: 100%;} small{position: absolute; z-index: 40; bottom: 0; margin-bottom: -15px;}\u003c/style\u003e\u003cdiv class=\"embed-container\"\u003e\u003csmall\u003e\u003ca href=\"//usfs.maps.arcgis.com/apps/Embed/index.html?webmap=51f650f63d534c7a9d8f76c8faf3fd40\u0026extent=-121.9516,47.7279,-120.029,48.6526\u0026home=true\u0026zoom=true\u0026scale=true\u0026legend=true\u0026basemap_gallery=true\u0026disable_scroll=true\u0026theme=light\" style=\"color:#0000FF;text-align:left\" target=\"_blank\"\u003eView larger map\u003c/a\u003e\u003c/small\u003e\u003cbr/\u003e\u003ciframe frameborder=\"0\" height=\"400\" marginheight=\"0\" marginwidth=\"0\" scrolling=\"no\" src=\"//usfs.maps.arcgis.com/apps/Embed/index.html?webmap=51f650f63d534c7a9d8f76c8faf3fd40\u0026extent=-121.9516,47.7279,-120.029,48.6526\u0026home=true\u0026zoom=true\u0026previewImage=false\u0026scale=true\u0026legend=true\u0026basemap_gallery=true\u0026disable_scroll=true\u0026theme=light\" title=\"Region 6 Wilderness Map\" width=\"500\"/\u003e\u003c/div\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eWith routes on 140 peaks and faces with rates among the best in the United States, this Wilderness is a popular destination for mountain climbers’. Blue Mountain’s 700-foot granite face routes are rated as high as 5.10. Other faces in the Wilderness exceed 1,000 feet.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eNote:\u003c/strong\u003e Due to the popularity of the area there are special restrictions in place throughout the Wilderness in order preserve the ecological integrity of the region. Help protect your wilderness by following wilderness \u003ca href=\"http://www.fs.usda.gov/detail/okawen/?cid=STELPRDB5405234\"\u003eregulations\u003c/a\u003e and using \u003ca href=\"http://lnt.org/learn/7-principles\" target=\"_blank\"\u003eLeave No Trace\u003c/a\u003e principles.\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eKey access points: \u003c/strong\u003e\u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recarea/?recid=79427#glacieraccess\"\u003eTrail and trailhead information\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstrong\u003eTopo Maps\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eAgnes mountain, Benchmark Mountain, Cascade Pass, Clark Mountain, Dome Peak, Downey Mountain, Gamma Peak, Glacier Peak East, Glacier Peak West, Goode Mountain, Holden, Huckleberry Mountain, Illabot Peaks, Lime Mountain, Lucerne, Mount David, Mount Lyall, Mount Pugh, Pinnacle Mountain, Poe Mountain, Prairie Mountain, Saska Peak, Schaefer Lake, Sloan Peak, Snowking Mountain, Sonny Boy Lakes, Stehekin, Suiattle Pass, Trinity, White Chuck Mountain. Download free \u003ca href=\"http://data.fs.usda.gov/geodata/rastergateway/states-regions/regions_zoom.php?regionID=r6\" target=\"_blank\"\u003eU.S. Forest Service Topo maps.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBuy maps online\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eGo to the \u003ca href=\"http://www.nationalforeststore.com\" target=\"_blank\"\u003eNational Forest Store.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWilderness.net \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eGo to \u003ca href=\"http://www.wilderness.net\" target=\"_blank\"\u003eWilderness.net\u003c/a\u003e for online maps and other important Wilderness information.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[0,0]},"FacilityLongitude":0,"FacilityLatitude":0,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"233997","LegacyFacilityID":"73954","OrgFacilityID":"AN373954","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"EAST KACHESS GROUP SITE","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eEast Kachess Group Site is closed for the 2019 camping season. \u003c/strong\u003e\u003cbr\u003e\u003cbr\u003eEast Kachess Group Campground is tucked away on the eastern shore of Kachess Lake in Okanogan-Wenatchee National Forest.   \u003cbr\u003e\u003cbr\u003eHemmed in by dense old-growth conifer forest and surrounded by high mountains, East Kachess Group Campground is secluded, making it an ideal setting for groups and families seeking recreation and relaxation.\u003c/p\u003e\n\u003ch2\u003eRecreation\u003c/h2\u003e\n\u003cp\u003eThis is a prime base camp for hiking, fishing, swimming, and mountain biking in summer and early fall and several trails are a short drive from the area.  \u003cbr\u003e\u003cbr\u003eAnglers will enjoy the scenic backdrop of the area while fishing for rainbow trout, cutthroat trout and kokanee salmon from boat or shoreline.\u003c/p\u003e\n\u003ch2\u003eFacilities\u003c/h2\u003e\nEast Kachess Group Campground has one large group site, able to accommodate up to 100 people and 25 vehicles.   \n\nThe campground is equipped with picnic tables, campfire rings with grills and vault toilets.\u003ch2\u003eNatural Features\u003c/h2\u003e\nKachess Lake, adjacent to the campground, is a reservoir that stores and provides water for irrigation for south-central Washington.    \n\nThe area is quite scenic, supporting wildlife such as deer, porcupine, native fish and migratory birds. These species, along with many others, depend on surrounding undeveloped wilderness, clean streams, and diverse forests to live.  \n\nEndangered and threatened species including the northern spotted owl and gray wolves also find havens in nearby ecosystems.\n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nHikers may want to traverse at least a portion of the spectacular Pacific Crest Trail (PCT), one of the world's premier National Scenic Trails. This trail showcases some of North America's most fantastic scenery as it winds its way its way from Mexico to Canada through California, Oregon and Washington.","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"From points west, take I-90 to exit 70. Turn left over freeway, then left again onto West Sparks Road. Follow West Sparks Road 0.5 mile and turn right onto Kachess Dam Roas/ Forest Road #4818. Travel approximately 5 miles to the campground on left.   \n\nFrom points east, take I-90 to exit 70. Turn right, then left onto West Sparks Road. Follow West Sparks Road 0.5 mile and turn right onto Kachess Dam Roas/ Forest Road #4818. Travel approximately 5 miles to the campground on left.   ","FacilityPhone":"509-852-1100","FacilityEmail":"briandspeeg@fs.fed.us","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.2188889,47.3069444]},"FacilityLongitude":-121.2188889,"FacilityLatitude":47.3069444,"Keywords":"EKAC,BOEING CAMP,OLD BOEING CAMP,BOEING ORGANIZATION SITE,OLD BOEING ORGANIZATION SITE,OKANOGAN - WENATCHEE NF -FS","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"244638","LegacyFacilityID":"","OrgFacilityID":"32138","ParentOrgID":"131","ParentRecAreaID":"1117","FacilityName":"Trailhead: South Climb","FacilityDescription":"\u003cp\u003e\u003cstrong\u003eProvides access to\u003c/strong\u003e: \u003ca href=\"http://www.fs.usda.gov/recarea/giffordpinchot/recarea/?recid=31934\"\u003eSouth Climb #183\u003c/a\u003e which enters \u003ca href=\"http://www.fs.usda.gov/recarea/giffordpinchot/recarea/?recid=79411\"\u003eMt Adams Wilderness\u003c/a\u003e\u0026nbsp;and is a major route to \u003ca href=\"http://www.fs.usda.gov/recarea/giffordpinchot/recarea/?recid=80023\"\u003eMt Adams Summit\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eTwo main parking areas in Cold Springs Campground, at the trailhead, can fill up quickly during the summer season.\u0026nbsp;\u003c/p\u003e\u003cp\u003eDrive with caution; traffic can be heavy in the high season.\u0026nbsp; Road is steep and narrow, with sharp switchbacks. No RVs or trailers.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Trout Lake, Washington take Mt Adams Road north to the V intersection with Forest Road 23. At this intersection stay to the right and continue about one mile to the left turn on to Forest Road 80, signed South Climb. Stay on Forest Road 80 to where it ends at the intersection with Forest Road 8040 and 8031. Make a right turn on to Forest Road 8040 and continue driving north past Morrison Creek Campground to South Climb Trailhead located in the old Cold Springs Camp area.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.497801,46.135663]},"FacilityLongitude":-121.497801,"FacilityLatitude":46.135663,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"265501","LegacyFacilityID":"","OrgFacilityID":"6818","ParentOrgID":"131","ParentRecAreaID":"1011","FacilityName":"Lower Kootenai River Area","FacilityDescription":"\u003cp\u003e\u003cimg align=\"left\" alt=\"Photo of Snyder Guard Station - a rental suitable for groups.\" src=\"http://www.fs.usda.gov/Internet/FSE_MEDIA/stelprdb5076697\" title=\"Photo of Snyder Guard Station - a rental suitable for groups.\" width=\"222\"/\u003eThe Lower Kootenai River Area (Bonners Ferry District) is bordered by the Purcell and Cabinet Ranges and the Montana Line on the east, the rugged Selkirk Range on the west, and the Canadian border to the north. The Kootenai River meanders north and west through the District, and the Moyie River joins it from the north.\u003c/p\u003e\u003cp\u003ePeaks are moderate in elevation (6000 - 7000 ft.) but are rugged due to heavy glaciation. They are renowned for their mountaineering challenge.\u003c/p\u003e\u003cp\u003eThere are many spectacular lakes, both low elevation lakes with easy access and high elevation, subalpine lakes, accessed only by trail or 'bushwhacking'.\u003c/p\u003e\u003cp\u003eNational Forest lands offer a full range of year-round recreational opportunities. Emphasis tends to be placed on backcountry, non-developed, semi-primitive recreation, yet urban activities such as auto touring, white water rafting, and car camping are common as well.\u003c/p\u003e\u003cp\u003eMore than 360 miles of summer use trail are open and usable on the District. Approximately 60 miles of that are open to motorized use; the remainder is suitable for stock use, hiking, and camping. Miles of gated road offer additional routes for mountain bikers, berry pickers, and hunters.\u003c/p\u003e\u003cp\u003eDispersed car camping is common throughout the District. Four campgrounds provide developed recreation opportunities in addition to several picnic and camping areas and interpretive sites.\u003c/p\u003e\u003cp\u003eThe District provides two lookouts and one cabin for rental to the public. Cold water and ice fishing are popular as are white water rafting, canoeing, and swimming. Berry and mushroom picking and Christmas tree cutting are seasonally popular.\u003c/p\u003e\u003cp\u003eWinter provides thousands of acres for cross-country skiing and snowmobiling. Groomed routes vary from year to year.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-116.383106,48.784706]},"FacilityLongitude":-116.383106,"FacilityLatitude":48.784706,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"273898","LegacyFacilityID":"","OrgFacilityID":"57119","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"Entiat Ranger District","FacilityDescription":"\u003cp\u003eThe Entiat Ranger District is a tapered slice of the Okanogan-Wenatchee National Forest, located in the more arid eastern edge of the Cascade Mountains. It extends from the Chelan Mountains in the northeast to the Entiat Mountains in the west.  The Entiat River Valley splits the Entiat Mountains from the Chelan Mountains, with the Columbia River flowing to the south and the Glacier Peak Wilderness Area standing majestically to the north. The landscape is dominated by wildfire ecology. Many areas of the Entiat Ranger District are excellent to observe examples of forest restoration, after large wildfires have occurred. Elevations range between 800 to more than 9,000 feet. The total acreage is 272,101 acres, which includes the Glacier Peak Wilderness Area at 25,557 acres.\u003c/p\u003e\u003cp\u003eHigh-quality recreation of all types exists in the Entiat Ranger District. The broad range of campgrounds and hiking trails provide access into relatively undeveloped zones of the Okanogan-Wenatchee National Forest that are excellent for hiking and fishing in solitude. Deep in the Glacier Peak Wilderness Area, at the end of the Entiat River Trail you can observe the last remaining remnants of the once massive Entiat Glacier. The glacier still clings to the impressive Entiat headwall, home to three 9,000’ peaks: Mt. Maude, Seven Finger Jack and Mt. Fernow. The Entiat Ranger District is also home to one of the nation’s most extensive multiple-use trail systems. This beloved trail system parallels lush alpine meadows, passes with pristine mountain lakes and climbs to lofty summits with breathtaking views of the wild North Cascade Range. Much of this trail system can be traveled by off-road motorcycles, mountain bikes, horses or hiking. \u003c/p\u003e\u003cp\u003eThe Entiat Ranger District is also part of a larger success story occurring on the Okanogan-Wenatchee National Forest. Proper land management practices have made the ranger district an amazing place for viewing a wide variety of wildlife. This includes elusive species like wolverine, moose, deer, bear, eagles, salmon and steelhead that frequent the Entiat Ranger District.\u003c/p\u003e\u003cp\u003e\u003ca href=\"http://www.fs.usda.gov/Internet/FSE_DOCUMENTS/fseprd549747.pdf\"\u003e\u003cstrong\u003eEntiat River Road Mileage chart\u003c/strong\u003e\u003c/a\u003e -- shows distance to campgrounds and road junctions from Highway 97A.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eDriving Directions to Ranger Station\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFrom the north starting out of Chelan, WA,\u003c/strong\u003e and travel south on U.S. Highway 97-Alt. for 18.8 miles to Entiat. Then, make a right turn on Hyland Avenue by the bank and food store. Make an immediate left turn onto Entiat Way.  The Entiat Ranger Station is on the right about 1/8 mile up Entiat Way.  If you cross the Entiat River bridge stop, turn around and try again.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFrom the west, south and east, start out of Wenatchee, WA.\u003c/strong\u003e Then, where U.S. Highway 2/U.S. 97 north merge take the ramp to U.S. Highway 97- Alt.-North. Proceed 15.8 miles north to Entiat. Make a left onto Hyland Avenue by the bank and food store. Make an immediate left onto Entiat Way. The Entiat Ranger Station is on the right about 1/8 mile up Entiat Way. If you pass a gas station on U.S. Highway 97-Alt. you have gone too far north. \u003c/p\u003e\u003cp\u003eSee \u003ca href=\"http://www.fs.usda.gov/Internet/FSE_DOCUMENTS/fseprd531347.pdf\"\u003e\u003cstrong\u003eLOCATION MAP\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003e2108 Entiat Way\u003cbr/\u003eP.O. Box 476\u003cbr/\u003eEntiat, WA 98822\u003cbr/\u003e(509) 784-4700 (Voice/TTY)\u003cbr/\u003eFax: (509) 784-9402\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[0,0]},"FacilityLongitude":0,"FacilityLatitude":0,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"235271","LegacyFacilityID":"","OrgFacilityID":"17522","ParentOrgID":"131","ParentRecAreaID":"1118","FacilityName":"Mt. Baker Highway (SR 542)","FacilityDescription":"\u003cp\u003eStarting at the northern boundaries of the forest, take a drive on the Mt. Baker Scenic Byway (State Route 542). This paved road starts at the Interstate 5 interchange in Bellingham, Wash., winds along the scenic North Fork Nooksack River, and climbs to an elevation of 5,140 feet to its well-named destination, Artist Point. This area is legendary for its spectacular views of Mt. Baker and Mt. Shuksan. Stop by the \u003ca href=\"http://www.fs.usda.gov/detail/mbs/?cid=STELPRDB5160278\"\u003eGlacier Public Service Center\u003c/a\u003e just east of Glacier at milepost 34 to learn about current forest road and trail conditions.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eMt. Baker - A State Scenic Highway and National Forest Scenic Byway\u003c/strong\u003e\u003cbr/\u003eState Route 542 is a Washington State Scenic Highway and a National Forest Scenic Byway. The forest byway begins just east of the town of Glacier as the route enters the national forest, leading travelers to historic Heather Meadows, home of the Mt. Baker Ski Area. Forest roads lead off the main highway into the heart of the national forest with trails accessing the Mt. Baker Wilderness and North Cascades National Park backcountry..\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFour Seasons of Recreation\u003c/strong\u003e\u003cbr/\u003eDuring summer months, Mt. Baker's 10,781 foot snow-covered peak rises above the landscape. On a clear day, several vantage points offer spectacular views of neighboring Mt. Shuksan and surrounding slopes of the Cascade Mountain range. Hikers can head out on more than 200 miles of trails and campers can enjoy long evenings in rustic settings. The fall months bring cooler temperatures and lower snow levels, limiting hiking access to the high country. Several side roads are groomed, turning them into a winter playland for snowmobiles and cross-country skiers. During winter months the \u003ca href=\"http://www.mtbaker.us/1011/\"\u003eMt. Baker Ski Area\u003c/a\u003e operates in Heather Meadows at the end of the byway. .\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eHeather Meadows\u003c/strong\u003e\u003cbr/\u003eHeather and huckleberry meadows dotting the Heather Meadows landscape near the eastern end of the Mount Baker Scenic Byway, (State Route 542). Glistening lakes nestle between knolls. Ridges bristle with 900-year-old mountain hemlock. Lava flows from Mount Baker have resisted glacial carving and columns of basalt stand like black anvils against the sky. During the summer months enjoy a picnic, stroll the trails and stop by the Heather Meadows Visitor Center for a historical perspective of the area’s rich heritage..\u003c/p\u003e\u003cp\u003e\u003ca href=\"http://www.fs.usda.gov/Internet/FSE_MEDIA/stelprdb5158089\" target=\"_blank\"\u003eRecreation Area Map\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"http://www.byways.org/explore/byways/2236/\"\u003eNational Scenic Byway\u003c/a\u003e\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.959465,48.891753]},"FacilityLongitude":-121.959465,"FacilityLatitude":48.891753,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"235369","LegacyFacilityID":"","OrgFacilityID":"80216","ParentOrgID":"131","ParentRecAreaID":"1118","FacilityName":"Ice Caves Trailhead","FacilityDescription":"\u003cp\u003e\u003cstrong\u003eProvides access to: \u003c/strong\u003e\u003ca href=\"http://www.fs.usda.gov/recarea/mbs/recarea/?recid=17728\"\u003eBig Four Ice Caves Trail #723\u003c/a\u003e.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom the Verlot Public Service Center (11 miles east of Granite Falls), go east on the Mountain Loop Highway 14.5 miles to the Big Four Picnic Area.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.51068807,48.06611396]},"FacilityLongitude":-121.51068807,"FacilityLatitude":48.06611396,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"246030","LegacyFacilityID":"","OrgFacilityID":"56561","ParentOrgID":"131","ParentRecAreaID":"1111","FacilityName":"Howard Creek Trailhead","FacilityDescription":"\u003cp\u003eTrailhead accessing Howard Creek Trail #3005\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-118.7217865,44.83928176]},"FacilityLongitude":-118.7217865,"FacilityLatitude":44.83928176,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"265454","LegacyFacilityID":"","OrgFacilityID":"67812","ParentOrgID":"131","ParentRecAreaID":"1116","FacilityName":"Batey-Bould Motorcycle Trailhead","FacilityDescription":"\u003cp\u003eThe trailhead is located at the most southern end of the trail system. Forty (40) miles of looped motorcycle trails can be accessed from this site. There are four first-come first-served free campsite. Garbage bins are provided for day use and campers only.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003e\u003cstrong\u003eFrom Newport, WA:  \u003c/strong\u003eFollow State Highway 20 north to Cusick. Proceed through Cusick and follow the highway for another half mile to the intersection of Kapps Lane (County Road 2341). This route is marked with large directional signs from Highway 20 to the trailhead. Turn left onto Kapps Lane and follow it for one mile until it intersects with West Calispell Road (County Road 9205). At this intersection, turn right and proceed for two miles to the intersection of West Calispell and Sicley Road (County Road 2341). Turn left onto Sicley Road and follow it for 1.5 miles to the trailhead area which is located on the left side of the road.\u003c/p\u003e\u003cp\u003eLatitude 48.37111111 Longitude -117.3722222\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-117.3722222,48.37111111]},"FacilityLongitude":-117.3722222,"FacilityLatitude":48.37111111,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2021-04-06"},{"FacilityID":"273979","LegacyFacilityID":"","OrgFacilityID":"58037","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"North Fork Entiat Trailhead","FacilityDescription":"\u003cp\u003eProvides access to: \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recreation/bicycling/recarea/?recid=58035\u0026actid=24\"\u003eNorth Fork Entiat River Trail #1437\u003c/a\u003e\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Wenatchee, WA, travel north on US-97A (west side of Columbia River) for 14.4 miles to Entiat, WA. Just after the bridge turn left onto Entiat River Road (County Road #19) and travel north 32.3 miles to Forest Road 5606. County Road #19 becomes Forest Road 51 at 27 miles. If your travel beyond \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recreation/recarea/?recid=58033\"\u003eNorth Fork Campground\u003c/a\u003e you have gone to far. On Forest Road 5606 travel north 3 miles to the end of road.\u003c/p\u003e\u003cp\u003eFrom Chelan, WA, travel south on US-97A (west side of Columbia River) for 19.3 milesto Entiat, WA. Just before the bridge turn right onto Entiat River Road (County Road #19) and travel north 32.3 miles to Forest Road 5606. County Road #19 becomes Forest Road 51 at 27 miles. If your travel beyond \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recreation/recarea/?recid=58033\"\u003eNorth Fork Campground\u003c/a\u003e you have gone to far. On Forest Road 5606 travel north 3 miles to the end of road.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-120.57217,48.011093]},"FacilityLongitude":-120.57217,"FacilityLatitude":48.011093,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"235309","LegacyFacilityID":"","OrgFacilityID":"43361","ParentOrgID":"131","ParentRecAreaID":"1118","FacilityName":"Stevens Pass Ski Resort","FacilityDescription":"\u003cp\u003e\u003ca href=\"http://www.stevenspass.com/\"\u003eStevens Pass Ski Resort\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eStevens Pass lodge additions project \u003ca href=\"http://www.fs.usda.gov/Internet/FSE_DOCUMENTS/stelprdb5331490.pdf\"\u003escoping letter\u003c/a\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003ciframe allowfullscreen=\"\" frameborder=\"0\" height=\"322\" src=\"https://www.youtube.com/embed/zrJZJ82kM1o?rel=0\" width=\"500\"/\u003e\u003c/p\u003e\u003cp\u003eFor information about accessible recreation opportunities in Pacific Northwest National Forests, visit http://www.fs.usda.gov/goto/r6/accessiblerecreation\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.09208934,47.74288505]},"FacilityLongitude":-121.09208934,"FacilityLatitude":47.74288505,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"232113","LegacyFacilityID":"70345","OrgFacilityID":"AN370345","ParentOrgID":"131","ParentRecAreaID":"1118","FacilityName":"Tinkham Campground","FacilityDescription":"\u003ch2\u003eOverview\u003c/h2\u003e\nTinkham Campground is located along the South Fork Snoqualmie River in Mt. Baker-Snoqualmie National Forest. It offers some of the most stunning scenery in Washington's North Cascades, as well as easy access to an abundance of recreational activities.\u003ch2\u003eRecreation\u003c/h2\u003e\nThe surrounding area is a prime location for hiking, fishing, picnicking and horseback riding in summer and early fall. In winter, visitors can take advantage of skiing and snowshoeing opportunities.\n\u003cbr /\u003e\u003cbr /\u003e\nA handful of hiking trails lie within a short driving distance, making Tinkham an ideal setting for both individual and family camping excursions. The 0.5-mile Tinkham Discovery Trail is an easy, family-friendly nature path. It weaves through fallen, moss-covered trees to a small pond. Children love investigating the insects, wildflowers and fungi along the trail.\u003ch2\u003eFacilities\u003c/h2\u003e\nTinkham Campground offers single-family sites, a few of which are accessible. Picnic tables and campfire rings with grills are provided, as are vault toilets and drinking water. No electrical hookups are available.\u003ch2\u003eNatural Features\u003c/h2\u003e\nThe campground sits alongside the river, in a towering canopy of Douglas fir, cedar and western hemlock, providing abundant shade.  \n\u003cbr /\u003e\u003cbr /\u003e\nRugged peaks, scenic rivers and abundant wildlife define the Mt. Baker-Snoqualmie National Forest and surrounding designated wilderness areas. On a clear day visitors can see Mt. Baker, which rises to an elevation of 10,781 feet. The active volcano is perpetually snow-capped. Mt. Baker's summit, Grant Peak, is actually a 1,300-foot-deep mound of ice, which hides a massive volcanic crater.\n\u003cbr /\u003e\u003cbr /\u003e\nWildlife in the area ranges from mountain goats in the higher elevations to coyotes and pine martens in the forests. Migratory birds and native fish find ample habitat in the varied ecosystems as well.\n\u003ch2\u003eNearby Attractions\u003c/h2\u003e\nMount Rainier National Park is about an hour away. This beautiful park offers fantastic glimpses of glaciers, subalpine ecology and volcanic landscapes. Hiking and scenic driving are the area's most popular activities.","FacilityTypeDescription":"Campground","FacilityUseFeeDescription":"","FacilityDirections":"From Seattle, Washington, go east on I-90 to Exit 42.  Turn south and go approximately 1 mile to the campground.","FacilityPhone":"360-804-1103","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"N","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.5816667,47.4058333]},"FacilityLongitude":-121.5816667,"FacilityLatitude":47.4058333,"Keywords":"TINK,MT. BAKER-SNOQU NF - FS","StayLimit":"","Reservable":true,"Enabled":true,"LastUpdatedDate":"2021-04-13"},{"FacilityID":"266303","LegacyFacilityID":"","OrgFacilityID":"72036","ParentOrgID":"131","ParentRecAreaID":"1116","FacilityName":"Carl's Lake","FacilityDescription":"\u003cp\u003e\u003ca href=\"http://www.fs.usda.gov/photogallery/colville/?cid=2941\"\u003e\u003cimg alt=\"Carl’s Lake\" src=\"http://www.fs.usda.gov/Internet/FSE_MEDIA/fseprd765997\" style=\"margin: 5px 10px 5px 5px; float: left\" width=\"518\"/\u003e\u003c/a\u003eCarl's Lake is a 20.2-acre secluded, shallow lake located 5.5 miles from Ione, Washington.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003e\u003cstrong\u003eFrom Ione, WA: \u003c/strong\u003eHead west on Main St towards S 2nd Ave. Turn left at the 1st cross street onto WA-31 S/S 2nd Ave. Turn right onto WA-20 W. Turn left onto NF-510.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.google.com/maps/dir/Ione,+WA/Carl's+Lake,+Washington/@48.700694,-117.4763966,13z/am=t/data=!4m14!4m13!1m5!1m1!1s0x5362f85a891fcd1b:0xc25f6e732c8ef4b2!2m2!1d-117.4171886!2d48.7410261!1m5!1m1!1s0x5362580b05961a65:0xfcc06a8bd21d418b!2m2!1d-117.4413769!2d48.6602592!3e0\"\u003eGoogle map directions from Ione, WA\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eFrom Colville, WA: \u003c/b\u003eHead north on N Maple St toward E 2nd Ave for 0.1 mile. Turn right at the 2nd cross street onto WA-20 E/E 3rd Ave, continue to follow WA-20 E for 31.3 miles. Turn right onto Forest Service Road (FSR) 9400500. Continue onto FSR 500 through two locked gates. Take a right on FSR 94005071 continue to the lake.\u003c/p\u003e\u003cp\u003e\u003ca href=\"#\"\u003eGoogle map directions from Colville, WA\u003c/a\u003e\u003c/p\u003e\u003cp\u003eLatitude 48.660650 Longitude -117.441206\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-117.441206,48.66065]},"FacilityLongitude":-117.441206,"FacilityLatitude":48.66065,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2021-04-06"},{"FacilityID":"265456","LegacyFacilityID":"","OrgFacilityID":"67828","ParentOrgID":"131","ParentRecAreaID":"1116","FacilityName":"Geophysical Sno-Park","FacilityDescription":"\u003cp\u003e\u003cimg alt=\"Geophysical Sno-Park Entrance\" src=\"http://www.fs.usda.gov/Internet/FSE_MEDIA/fseprd873435\" style=\"margin: 5px 10px 5px 5px; float: left\" width=\"500\"/\u003e\u003c/p\u003e\u003cp\u003eLocated near Newport, Washington this 6.2 mile groomed sno-park is found at a lower elevation so it is highly encouraged visitors check current groom reports before visiting. Please do not use the groomed trail system unless you are on skis or snowshoes. Never walk on tracks, this can easily ruin the track for other users, and is hard to fix with the groomer. \u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003e\u003cstrong\u003eFrom Newport, WA: \u003c/strong\u003e Follow U.S. Route 2 across the Pend Oreille River into Idaho and turn north on LeClerc Road (county road 9305). Continue on road 9305 for 7.5 miles to the intersection with Indian Creek Road. Turn east and continue on Indian Creek Road for 1.5 miles to trailhead.\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://www.google.com/maps/dir/Newport,+WA/'48.25389,-117.1214'/@48.2167166,-117.1255016,13z/data=!3m1!4b1!4m11!4m10!1m5!1m1!1s0x5362238aa17a0853:0x82b24cc02f17c1c9!2m2!1d-117.0432583!2d48.1796277!1m3!2m2!1d-117.1214!2d48.25389\"\u003eGoogle map directions from Newport, WA\u003c/a\u003e\u003c/p\u003e\u003cp\u003eLatitude 48.25388889 Longitude -117.12138889\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-117.12138889,48.25388889]},"FacilityLongitude":-117.12138889,"FacilityLatitude":48.25388889,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2021-04-06"},{"FacilityID":"244665","LegacyFacilityID":"","OrgFacilityID":"74275","ParentOrgID":"131","ParentRecAreaID":"1117","FacilityName":"Forest Road 52/Skate Creek Road","FacilityDescription":"\u003cp\u003eForest Road 52, also known as Skate Creek Road, travels east to west, between Packwood and Elbe.\u0026nbsp; FR 52 is a paved road that has had low maintenance for a number of years.\u0026nbsp; Please watch your speed.\u0026nbsp; There are a number of slumps and potholes in the road.\u003c/p\u003e\u003cp\u003eFR 52 travels through low elevation forest following beautiful Skate Creek.\u0026nbsp; The forest contains evergreen and deciduous trees.\u0026nbsp;\u0026nbsp; And offers beautiful fall colors and plenty of cooler temperatures in the summer.\u0026nbsp; The area offers several dispersed camping sites and fishing in the creek.\u003c/p\u003e\u003cp\u003eIn the winter months, FR52 is often gated closed when the snow gets too deep to drive safely.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eTacoma Power and the WDFW will NOT be stocking Skate Creek with catchable trout in the future.\u0026nbsp; This is in order to comply with new State regulations prohibiting stocking catchable trout species in anadromous waters.\u0026nbsp; Skate Creek qualifies as \u0026ldquo;anadromous waters\u0026rdquo; because of the ongoing salmon/steelhead reintroduction program for the upper Cowlitz River. \u003c/strong\u003e\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"","COORDINATES":null},"FacilityLongitude":0,"FacilityLatitude":0,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"235319","LegacyFacilityID":"","OrgFacilityID":"79417","ParentOrgID":"131","ParentRecAreaID":"1118","FacilityName":"Boulder River Wilderness","FacilityDescription":"\u003cp\u003eTowering to nearly 7,000 feet above valleys not far above sea level, the tall peaks of Whitehorse Mountain and Three Fingers are the two most prominent landmarks in this wilderness and are very visible from much of the Puget Sound area. The South Peak of Three Fingers is home to an old fire lookout. Climbers are challenged by the mixed rock and ice climbs available on the higher peaks, while wonderful rock routes are found in both the Squire and Clear Creek valleys.\u003c/p\u003e\u003cp\u003e\u003ca href=\"http://www.fs.usda.gov/recarea/mbs/recarea/?recid=17732\"\u003eBoulder River Trail\u003c/a\u003e is the most popular trail in the wilderness and passes through gorgeous old growth forest of Douglas Fir, western hemlock, western red cedar with even a few Sitka spruce thrown in. Just inside the wilderness on the trail popular “Feature Show Falls” drops over a 200 foot cliff directly into the Boulder River. Precipitation in the area exceeds 150 inches per year annually and combined with the steep terrain and thick brush, makes off-trail travel arduous.\u003c/p\u003e\u003cp\u003eThs wilderness is inhabited with a variety of wildlife including black bears, black-tailed deer, cougar and mountain goats staking out the rocky shelves. Congress designated the Boulder River Wilderness in 1984 and it now has a total of 49,343 acres.\u003c/p\u003e\u003cp\u003eHelp protect your wilderness by following \u003ca href=\"http://www.fs.usda.gov/detail/mbs/specialplaces/?cid=fsbdev7_001639 \"\u003ewilderness regulations \u003c/a\u003eand using \u003ca href=\"http://lnt.org/learn/7-principles\" target=\"_blank\"\u003eLeave No Trace \u003c/a\u003eprinciples.\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eKey access points: \u003c/strong\u003e\u003ca href=\"http://www.fs.usda.gov/recarea/mbs/recarea/?recid=79417#accessboulder \"\u003eTrail and trailhead information\u003c/a\u003e.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cstyle type=\"text/css\"\u003e.embed-container {position: relative; padding-bottom: 80%; height: 0; max-width: 100%;} .embed-container iframe, .embed-container object, .embed-container iframe{position: absolute; top: 0; left: 0; width: 100%; height: 100%;} small{position: absolute; z-index: 40; bottom: 0; margin-bottom: -15px;}\u003c/style\u003e\u003c/p\u003e\u003cdiv class=\"embed-container\"\u003e\u003csmall\u003e\u003ca href=\"//usfs.maps.arcgis.com/apps/Embed/index.html?webmap=51f650f63d534c7a9d8f76c8faf3fd40\u0026extent=-121.9285,48.0584,-121.4493,48.2892\u0026home=true\u0026zoom=true\u0026scale=true\u0026legend=true\u0026basemap_gallery=true\u0026disable_scroll=true\u0026theme=light\" style=\"color:#0000FF;text-align:left\" target=\"_blank\"\u003eView larger map\u003c/a\u003e\u003c/small\u003e\u003cbr/\u003e\u003ciframe frameborder=\"0\" height=\"400\" marginheight=\"0\" marginwidth=\"0\" scrolling=\"no\" src=\"//usfs.maps.arcgis.com/apps/Embed/index.html?webmap=51f650f63d534c7a9d8f76c8faf3fd40\u0026extent=-121.9285,48.0584,-121.4493,48.2892\u0026home=true\u0026zoom=true\u0026previewImage=false\u0026scale=true\u0026legend=true\u0026basemap_gallery=true\u0026disable_scroll=true\u0026theme=light\" title=\"Region 6 Wilderness Map\" width=\"500\"/\u003e\u003c/div\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003e\u003cstrong\u003eTopo Maps\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eMeadow Mountain, Whitehorse Mountain, Helena Ridge, Silverton, Malardy Ridge. Download free \u003ca href=\"http://data.fs.usda.gov/geodata/rastergateway/states-regions/regions_zoom.php?regionID=r6\" target=\"_blank\"\u003eU.S. Forest Service Topo maps.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eBuy maps online\u003c/strong\u003e\u003c/p\u003e\u003cp\u003eGo to the \u003ca href=\"http://www.nationalforeststore.com\" target=\"_blank\"\u003eNational Forest Store.\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eWilderness.net \u003c/strong\u003e\u003c/p\u003e\u003cp\u003eGo to \u003ca href=\"http://www.wilderness.net\" target=\"_blank\"\u003eWilderness.net\u003c/a\u003e for online maps and other important Wilderness information.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[0,0]},"FacilityLongitude":0,"FacilityLatitude":0,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"274051","LegacyFacilityID":"","OrgFacilityID":"58709","ParentOrgID":"131","ParentRecAreaID":"16822","FacilityName":"Chiwawa Horse Camp","FacilityDescription":"\u003cp\u003eLocated near the Chiwawa River at Rock Creek this campground is approximately 15 miles up the Chiwawa River Road #6200. It offers 7 long pull-through spurs and horse facilities. It is wheelchair accessible.  The \u003ca href=\"http://www.fs.usda.gov/recarea/okawen/recreation/hiking/recarea/?recid=58647\u0026actid=50\"\u003eBasalt Ridge Trail #1527\u003c/a\u003e and The \u003ca href=\"www.fs.usda.gov/recarea/okawen/recreation/hiking/recarea/?recid=58959\u0026actid=50\"\u003eRock Creek Trail #1509\u003c/a\u003e are accessed from this horsecamp.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Leavenworth, WA, take US-2 North for 15 miles. Turn right on WA-207 (Lake Wenatchee Highway) and go 4.4 miles. Turn right onto Chiwawa Loop Road. Travel 0.4 miles, then stay right at the intersection. Take the second left onto Chiwawa River Road (Forest Road 6200) and follow for about 15 miles to the campground.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-120.792,47.9725]},"FacilityLongitude":-120.792,"FacilityLatitude":47.9725,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"248862","LegacyFacilityID":"","OrgFacilityID":"80676","ParentOrgID":"131","ParentRecAreaID":"1120","FacilityName":"Mt. Ellinor Lower Trailhead","FacilityDescription":"\u003cp\u003e\u003cstrong\u003eProvides lower access to:\u003c/strong\u003e \u003ca href=\"http://www.fs.usda.gov/recarea/olympic/recreation/recarea/?recid=47881\"\u003eMt. Ellinor Trail #812\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe lower trail climbs gently through the forest for the first mile, and then becomes steeper and increasingly rough. At timberline, 2.5 miles from the lower trailhead, the trail intersects the winter climbing route to the right and the summer trail route to the left. This is a good turnaround point for inexperienced hikers.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-123.2317182,47.50709873]},"FacilityLongitude":-123.2317182,"FacilityLatitude":47.50709873,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"246010","LegacyFacilityID":"","OrgFacilityID":"56497","ParentOrgID":"131","ParentRecAreaID":"1111","FacilityName":"Glade Creek/Cold Springs Trailhead","FacilityDescription":"\u003cp\u003e\u003cstrong\u003eProvides access to:\u003c/strong\u003e\u0026nbsp;\u003ca href=\"http://www.fs.usda.gov/recarea/umatilla/recarea/?recid=56495\"\u003eCold Spring Trail #3008\u003c/a\u003e\u0026nbsp;and\u0026nbsp;\u003ca href=\"http://www.fs.usda.gov/recarea/umatilla/recarea/?recid=56549\"\u003eGlade Creek Trail #3014\u003c/a\u003e\u0026nbsp;which enter\u0026nbsp;\u003ca href=\"http://www.fs.usda.gov/recarea/umatilla/recarea/?recid=56915\"\u003eNorth Fork John Day Wilderness.\u003c/a\u003e\u003c/p\u003e\u003cp\u003eThe trailhead is at the end of a short, steep loop spur. There is a dispersed camp site with parking for 2 trucks with trailers. \u0026nbsp;\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eDirections:\u003c/strong\u003e\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFrom Dale, OR\u003c/strong\u003e, go north on US-395 about 1.2 miles and turn right (east) onto Forest Road 55. \u0026nbsp;After less than 1 mile, turn right onto Forest Road 10 and travel about 10 miles east to Forest Road 1010. \u0026nbsp;Turn left on Forest Road 1010 and go about 10 miles to the Glade Creek/Cold Springs Trailhead on the north side of the road.\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eFrom Granite, OR\u003c/strong\u003e travel west on Grant County Road 24 (Forest Road 10) for 3.4 miles until the pavement turns to gravel. Continue on Forest Road 10, which turns uphill to the right (west). Travel another 11.5 miles on Forest Road 10 (past the entrance to Olive Lake) then turn right (north) onto Forest Road 1010. \u0026nbsp;Travel about 6 miles west on Road 1010 and the trailhead is up a steep spur road on the right. The spur road is about 1.5 miles west of the turn-off \u0026nbsp;for Desolation Lookout.\u0026nbsp;\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-118.6774804,44.856278]},"FacilityLongitude":-118.6774804,"FacilityLatitude":44.856278,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"10071154","LegacyFacilityID":"","OrgFacilityID":"48091","ParentOrgID":"131","ParentRecAreaID":"","FacilityName":"Spider Lake Trailhead","FacilityDescription":"\u003cp\u003e\u003cstrong\u003eProvides access to\u003c/strong\u003e: \u003ca href=\"http://www.fs.usda.gov/recarea/olympic/recarea/?recid=47941\"\u003eSpider Lake Loop Trail #879\u003c/a\u003e\u003c/p\u003e\u003cp\u003eEnter trail from either the North or South end of lake.\u003c/p\u003e\u003cp\u003eNote: The trail and lake might not be signed, look for Spider Lake below the Forest Road 23 on the east side of the road.\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Shelton, WA travel 7 miles north on Highway 101. Turn west on the Valley Road and drive about 5.5 miles to the junction with Forest Road 23. Turn right and proceed for 10 miles on Forest Road 23 to the junction of Forest Road 2353. Veer left and continue on Forest Road 23 (end of pavement) another 8 miles to the Spider Lake Trailhead.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-123.4285088,47.41284013]},"FacilityLongitude":-123.4285088,"FacilityLatitude":47.41284013,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"248507","LegacyFacilityID":"","OrgFacilityID":"27699","ParentOrgID":"130","ParentRecAreaID":"257","FacilityName":"Boyer Park and Marina","FacilityDescription":"This recreation area is part of \u003ca href=http://www.recreation.gov/recreationalAreaDetails.do?contractCode=NRSO\u0026recAreaId=257\u0026agencyCode=130\u003eLake Bryan\u003c/a\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-117.44803883,46.68119595]},"FacilityLongitude":-117.44803883,"FacilityLatitude":46.68119595,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"271857","LegacyFacilityID":"","OrgFacilityID":"74390","ParentOrgID":"131","ParentRecAreaID":"16684","FacilityName":"Forest Road 24","FacilityDescription":"\u003cp\u003eForest Road 24 starts at the end of Hwy 141 west of Trout Lake at the Forest Service Boundary and ends at the junction with the 8851 Road north of Big Mosquito Lake.   Areas of interest along this road are Atkinson Sno-Park and Group Camp, The Ice Cave entrance and Picnic area, Peterson Prairie Campground and Cabin, Little Goose Lake, Meadow Creek Campground, Berry Fields, and Big Mosquito Lake. \u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"","COORDINATES":null},"FacilityLongitude":0,"FacilityLatitude":0,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"238876","LegacyFacilityID":"","OrgFacilityID":"47693","ParentOrgID":"131","ParentRecAreaID":"1120","FacilityName":"Pacific Ranger District-Forks","FacilityDescription":"\u003cp\u003e\u003cimg alt=\"Forks Ranger District Office\" src=\"http://www.fs.usda.gov/Internet/FSE_MEDIA/stelprdb5364541.jpg\" style=\"width: 200px; height: 125px;\"/\u003e437 Tillicum Lane\u003cbr/\u003eForks, WA 98331\u003cbr/\u003e\u003cstrong\u003ePhone:\u003c/strong\u003e (360) 374 6522\u003cbr/\u003e\u003cstrong\u003eTDD\u003c/strong\u003e (360) 374 6522\u003c/p\u003e\u003cp\u003e\u003cstrong\u003eAvailable at Forks office\u003c/strong\u003e: Maps. Firewood, mushroom, salal and Christmas tree permits. See: \u003ca href=\"http://www.fs.usda.gov/detail/olympic/?cid=FSBDEV3_049528\"\u003eSpecial Forest Product permit information.\u003c/a\u003e\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom Aberdeen, WA take Highway 101 north for 107 miles to the north part of Forks, WA (53 miles west of Port Angeles). Then turn east on to Tillicum Lane and follow the road for about two blocks to the district office at 437 Tillicum Lane.\u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-124.38359,47.95636]},"FacilityLongitude":-124.38359,"FacilityLatitude":47.95636,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"},{"FacilityID":"235397","LegacyFacilityID":"","OrgFacilityID":"80233","ParentOrgID":"131","ParentRecAreaID":"1118","FacilityName":"Park Butte Trailhead","FacilityDescription":"\u003cp\u003e\u003cstrong\u003eProvides access to\u003c/strong\u003e: \u003ca href=\"http://www.fs.usda.gov/recarea/mbs/recarea/?recid=17616\"\u003ePark Butte Trail 603\u003c/a\u003e, \u003ca href=\"http://www.fs.usda.gov/recarea/mbs/recarea/?recid=17622\"\u003eScott Paul Trail 603.1\u003c/a\u003e, \u003ca href=\"http://www.fs.usda.gov/recarea/mbs/recarea/?recid=17618\"\u003eRailroad Grade Trail 603.2\u003c/a\u003e, \u003ca href=\"http://www.fs.usda.gov/recarea/mbs/recarea/?recid=17604\"\u003eBell Pass Trail 603.3\u003c/a\u003e.\u003c/p\u003e\u003cp\u003eThis trailhead is the primary access point for \u003ca href=\"http://http/www.fs.usda.gov/recarea/mbs/recarea/?recid=30330\"\u003eMt. Baker National Recreation Area.\u003c/a\u003e\u003c/p\u003e","FacilityTypeDescription":"Facility","FacilityUseFeeDescription":"","FacilityDirections":"\u003cp\u003eFrom the \u003ca href=\"https://www.google.com/maps/place/810+WA-20,+Sedro-Woolley,+WA+98284/@48.503185,-122.225089,15z/data=!4m2!3m1!1s0x54851292edd1f1e9:0x781b9ee68b892da9?hl=en\"\u003eMt. Baker Ranger District\u003c/a\u003e office in Sedro-Woolley, WA follow State Route 20 east for 16 miles to milepost 82. Turn left (north) on the Baker Lake Highway (Forest Service Road 11). Continue on at mile 12, turn left on Forest Service Road 12. Travel 3.6 miles to the junction of Forest Service Road 13. Stay to right and follow FS Road 13 for 5.3 miles. The trailhead is located at the end of FS Road 13. \u003c/p\u003e","FacilityPhone":"","FacilityEmail":"","FacilityReservationURL":"","FacilityMapURL":"","FacilityAdaAccess":"","GEOJSON":{"TYPE":"Point","COORDINATES":[-121.81256425,48.70706221]},"FacilityLongitude":-121.81256425,"FacilityLatitude":48.70706221,"Keywords":"","StayLimit":"","Reservable":false,"Enabled":true,"LastUpdatedDate":"2020-09-10"}],"METADATA":{"RESULTS":{"CURRENT_COUNT":50,"TOTAL_COUNT":592},"SEARCH_PARAMETERS":{"QUERY":"","LIMIT":50,"OFFSET":0}}}